[{"pos": "1", "title":"Preferences - Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html", "body":"Portfolio preferences include relevant preferences for managing portfolios. These preferences allow you to set the options available in the fields when defining the basic information of a portfolio in the Basic info tab on the Portfolio window. The options you set up in these preferences allow you to flexibly group your portfolios. In addition, rebalancing preferences allow you to set up preferences for rebalancing."},
{"pos": "2", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"Benchmark indices are used to compare the performance or return of a portfolio to an index. The benchmark index linked to a portfolio is visible, for example, in some P\/L reports, and in Analytics Plus. Benchmark indices can be:"},
{"pos": "3", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"Single or composite. Single benchmarks consist of one index. Composite benchmarks consist of a combination of different indices (for example, a composite of 40 % index A and 60 % index B)."},
{"pos": "4", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"Regular or interpolated. Regular benchmarks are based on the dates and position shares that you entered. For example, you can set a benchmark that is valid from 01.01.2022 and contains 20% of a certain stock. Then, you can raise the position share, for example, to 22% starting from 01.03.2023, and so on. Interpolated benchmarks are based on the position shares on the start and end date of the period. The values between the dates are calculated by the system to create a gradual daily change. For example, if you want to reduce investments in a particular sector from 30% to 20% over 5 years, you can enter two dates and specify the start and end position shares. The values in between the dates will be calculated automatically."},
{"pos": "5", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"General or portfolio-specific. General benchmark indices are defined in Preferences. You can then apply them to a portfolio by choosing a general benchmark in the Portfolio window, Benchmark tab. Portfolio-specific benchmarks are defined per portfolio in the Portfolio window."},
{"pos": "6", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"If multiple portfolios follow the same benchmark index, it is worth defining a general benchmark index. Also, any modifications made to the general benchmark index affect the portfolios linked to the index."},
{"pos": "7", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"The benchmark index information is defined in the fields on the right side of the window: a red star indicates a mandatory field."},
{"pos": "8", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Benchmark index name*"},
{"pos": "9", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"The name of the benchmark index."},
{"pos": "10", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Date"},
{"pos": "11", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"The date from which the benchmark index is valid in a portfolio. This is usually the start date of your portfolio (when the portfolio starts getting in transactions). If you have a regular benchmark, define one date and enter the position shares. You can later update the benchmark by adding a new date and re-defining the index positions. The updated index is valid from the new date onward. If you have an interpolated benchmark, you need to enter at least two dates: start date and end date of the change. For example, if you set a start date to 8.10.2022, the position shares get changed on 9.10.2022."},
{"pos": "12", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Interpolate shares between dates"},
{"pos": "13", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Whether a benchmark is interpolated."},
{"pos": "14", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Holiday calendar"},
{"pos": "15", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"For an interpolated benchmark, set the holiday calendar to use. Position shares change only on business days."},
{"pos": "16", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Under each date in the table, you can see the index content. To add a position, click Add in the table row."},
{"pos": "17", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Date"},
{"pos": "18", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"See the Date field description above."},
{"pos": "19", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Security"},
{"pos": "20", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"The security the index follows. If you add securities in other currency than the portfolio's currency, the index values are converted to your portfolio's currency with a relevant FX rate."},
{"pos": "21", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"For interpolated benchmarks, the start and end date indices must contain the same set of securities. If you want a position to be sold out gradually, add it with 0% weight on the end date."},
{"pos": "22", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Share %"},
{"pos": "23", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"The position share in the index. Position shares of different securities under one date must sum up to 100."},
{"pos": "24", "title":"Limit definitions", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#limit-definitions", "body":"Limit definition preferences allow you to define limits, or investment constraints, that you can link to your portfolios for limit monitoring. For more information, see Limit definitions."},
{"pos": "25", "title":"Portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolio-types", "body":"In the Portfolio type preferences you can define the portfolio types available for portfolios. Portfolio types are used to categorize the portfolios: for example, the portfolios could be divided into investment portfolios and insurance portfolios. For portfolio, a portfolio type is mandatory."},
{"pos": "26", "title":"Portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolio-types", "body":"Portfolio types can be defined in the Portfolio type window in the Preferences. A portfolio type consists of a code and a name: the code is used to identify the portfolio type in the system, and the name is used to view and choose the portfolio type in the user interface."},
{"pos": "27", "title":"Restricting access to portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#restricting-access-to-portfolio-types", "body":"Portfolio types also support restricting them to be shown only to specific user roles, allowing you to restrict the list of available portfolio types per user role within the Portfolio type dropdown in the Portfolio window's Basic information and Portfolio view's extended search fields. For example, you can decide which user role(s) are allowed to use which portfolio types for the portfolios they manage, especially useful in restricting the visibility of custom fields linked to a certain portfolio type."},
{"pos": "28", "title":"Restricting access to portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#restricting-access-to-portfolio-types", "body":"If you want to restrict a portfolio type to be shown to only certain user role(s), you can do this by checking the appropriate roles within the portfolio type preferences - once checked, the type will be available only to the users with the selected role(s). If you don’t restrict a portfolio type to a specific user role, it will be visible to all users."},
{"pos": "29", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Portfolios preferences allow you to enable different settings related to portfolios."},
{"pos": "30", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Generate a running number for portfolio ID automatically"},
{"pos": "31", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"When enabled, a running number is automatically created for a new portfolio as the portfolio ID, starting from number 1. When enabled, the next available number is set as the portfolio ID in the Portfolio window."},
{"pos": "32", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Show memos for the selected customer's all portfolios on the overview"},
{"pos": "33", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"When enabled, the Memo section on the Overview shows the memos for all of the selected customer's portfolios at the same time, instead of showing only the memo of the selected customer or portfolio."},
{"pos": "34", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Enabling this might slow down opening customers with lots of portfolios under them on the Overview."},
{"pos": "35", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Define the maximum number of portfolios shown in \"Portfolio hierarchy\" tree on the Overview"},
{"pos": "36", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"You can configure how many portfolios are shown in the \"Portfolio hierarchy\" section on the Overview, allowing you to control how many portfolios are shown for example when viewing a large portfolio group. By default, 500 portfolios are shown."},
{"pos": "37", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"In the rebalancing preferences you can define the \"method\" for creating trade orders from rebalancing as well as the transaction types used in creating buy and sell trade orders when rebalancing a portfolio."},
{"pos": "38", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"First, define the \"method\" trade orders are created by rebalancing."},
{"pos": "39", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Create trade orders based on trade amount (calculate unit price based on amount and difference)"},
{"pos": "40", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose this option if you want to fix the amount and trade amount of the trade orders created by rebalancing and adjust the unit price to match amount * unit price = trade amount (default option). With this option, you will end up with trade orders that should be executed \"with trade amount\", since the trade amount equals the difference in the position between the rebalanced portfolio and the model portfolio."},
{"pos": "41", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Create trade orders based on amount (calculate trade amount based on amount and market unit price)"},
{"pos": "42", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose this option if you instead want to fix the amount and unit price of the trade orders created by rebalancing and adjust the trade amount to match amount * unit price = trade amount. With this option, you will end up with trade orders that should be executed \"with amount\", since the amount and unit price equal the difference in the position between the rebalanced portfolio and the model portfolio on the rebalancing date."},
{"pos": "43", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Despite the \"method\" you selected, the trade orders are formed with the same logic, and the amount is always calculated in the same way - this selection determines whether the final trade orders are created by adjusting the unit price or trade amount to achieve valid calculations for amount * unit price = trade amount."},
{"pos": "44", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Below, define the transaction types used for the created trade orders, and when the trade orders are executed, for the transactions recorded to the portfolios."},
{"pos": "45", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Select the transaction type for \"buy\" trade orders (mandatory)"},
{"pos": "46", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose the transaction type used to create buy trade orders from rebalancing. This is the transaction type used for all buys."},
{"pos": "47", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Select the transaction type for \"sell\" trade orders (mandatory)"},
{"pos": "48", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose the transaction type used to create sell trade orders from rebalancing. This is the default transaction type used for sells."},
{"pos": "49", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Select the transaction type used for trade orders when selling an entire position (optional, if not defined, then the selected \"sell\" type is used)"},
{"pos": "50", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose the transaction type used for sell trade orders when rebalancing creates a sell trade order based on units instead of trade amount, for example when selling away an entire position from a portfolio. If left empty, the selected sell type is used for all kinds of sell trade orders."},
{"pos": "51", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Below, you can define a target range for portfolio's cash balance or buffer for cash to ensure positive cash balance. These preferences specifically affect what kind of trade orders are created when rebalancing is restricted to accounts."},
{"pos": "52", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define target range for portfolio's cash balance (when rebalancing cash, portfolio is rebalanced only if cash is outside of the target range)"},
{"pos": "53", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define a target range, or minimum and maximum, for portfolio's cash balance: when restricting rebalancing to accounts, portfolio is rebalanced and trade orders created only if cash is outside of the defined target range. You can for example define that if there is between $0 and $10 on your account, portfolio would not be rebalanced at all to avoid unnecessarily small trades when there is only a little cash. Defaults for minimum and maximum are 0, resulting in target range of 0 cash balance."},
{"pos": "54", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Minimum (in currency) - define a minimum in currency for your target range."},
{"pos": "55", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Maximum (in currency) - define a maximum in currency for your target range"},
{"pos": "56", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much negative cash balance is increased by to cover all negative cash"},
{"pos": "57", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much negative cash balance is increased by when restricting rebalancing to accounts in order to ensure positive cash balance after all trades have gone through, even if market fluctuates unfavorably. You can define the buffer both as percentage and in currency, when the system would use the value resulting in a larger buffer. For example, if you have -100€ on your account and icrease defined as 2% (buffer 100€ * 2% = 20€) and 10€, rebalancing would use cash worth -100€ - 20€ (larger buffer used, 20€ > 10€) = -120€, i.e. rebalancing would sell worth a bit more to ensure negative balance will be covered."},
{"pos": "58", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Increase as percentage (%) - define the increase as percentages."},
{"pos": "59", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Increase in currency - define the decrease directly in currency"},
{"pos": "60", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much positive cash balance is decreased by to ensure positive cash balance"},
{"pos": "61", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much positive cash balance is decreased by when restricting rebalancing to accounts in order to ensure positive cash balance after all trades have gone through, even if market fluctuates unfavourably. You can define the buffer both as percentage and in currency, when the system would use the value resulting in a larger buffer. For example, if you have 100€ on your account and decrease defined as 2% (buffer 100€ * 2% = 20€) and 10€, rebalancing would only use cash worth 100€ - 20€ (larger buffer used, 20€ > 10€) = 80€."},
{"pos": "62", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Decrease as percentage (%) - define the decrease as percentages."},
{"pos": "63", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Decrease in currency - define the decrease directly in currency."},
{"pos": "64", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Below, you can define a limit for cash from sells used for buys. This allows you to be more conservative when doing a full rebalance: expected cash from sell orders is used to generate buys within the rebalance on one go, but sell orders' values are not counted for as 100% but for example as 90% or 95%. With this, even if prices drop between the time of the rebalance and the time of the execution of your sell orders (and you don't end up getting as much cash from your sells as originally expected), you most likely will get enough cash from your sells to execute your buys (since buys were not generated expecting 100% from your sells but a smaller percentage such as 90% or 95%)."},
{"pos": "65", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how many percent (%) of cash from sells can be used to buy with"},
{"pos": "66", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define as a number between 0 and 100. Default is 100, indicating that 100% of cash from sells is used to generate buy orders with. This setting is considered when you use a rebalance method that \"buys with cash from sells\": this setting limits how big a share of the sell's value is used to generate buy orders."},
{"pos": "67", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"You can also select what kind of a position listing the summary of the rebalance is shown."},
{"pos": "68", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Aggregate positions in the rebalance window"},
{"pos": "69", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Allows you to determine how you want the rebalancing window to show your positions, whether you want to aggregate positions or whether you want to group positions per portfolio."},
{"pos": "70", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"If enabled, positions of all rebalanced portfolios are aggregated (summed up): one row is shown for each position, and the values on the row sum up all positions for that security."},
{"pos": "71", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"If disabled, positions are grouped by portfolio."},
{"pos": "72", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Finally, you can enable rebalancing with real-time 15 minutes delayed prices, fetched with a corresponding Market Price Connector from SIX. This allows you to utilize the 15 minutes delayed real-time market price feed from SIX to get more up-to-date results from rebalancing your portfolios – the more up-to-date your prices are, the more accurate is the prediction on how much to buy or sell."},
{"pos": "73", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Rebalancing with 15min delayed prices"},
{"pos": "74", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Allows you to rebalance your portfolios with 15 minutes delayed real-time prices. Every time you trigger a rebalance on your portfolio(s), the market price connector fetches the latest available prices for all your positions' securities directly from SIX, and uses the prices when calculating your trade orders."},
{"pos": "75", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Rebalancing will always use the latest available price it can find - if you the connector to SIX is not enabled, or if you for some reason don't get a price through the connector for a security, then the latest available price stored in FA is used. Also, prices fetched from SIX are converted to portfolio currency with latest fx rates stored in FA when necessary."},
{"pos": "76", "title":"Portfolio window", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html", "body":"Portfolio window allows you to create a new portfolio or to view and edit the information of existing portfolios. You can create a new portfolio through the menu in New - New portfolio, and you can view the information of existing portfolios by double-clicking a portfolio either from your search result on the Portfolios view or from the Overview."},
{"pos": "77", "title":"Portfolio window", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html", "body":"The basic information for the portfolio is defined in the Basic info tab, and other tabs are used to define additional information for the portfolio. Remember to check that the portfolio has a customer as a primary contact in the Contacts tab, and if you are tracking cash balances in your portfolio, remember to add appropriate accounts in the Accounts tab."},
{"pos": "78", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Basic info tab allows you to define the basic information of the portfolio, such as ID and name. A red star indicates that a field is mandatory."},
{"pos": "79", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"The available fields are:"},
{"pos": "80", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Portfolio ID*. An individual ID defined for a portfolio. The portfolio ID separates a portfolio from other portfolios (the system does not allow more than one portfolio with a same portfolio ID). The portfolio ID is used to identify and search for a portfolio, and many of the Import functions utilize the portfolio ID. When creating a new portfolio, if the \"Generate a running number for portfolio ID automatically\" is enabled in Portfolios Preferences, the next available number is automatically set as the portfolio ID. Best practice is not to include special characters into the portfolio ID - only use numbers and letters (a-z)."},
{"pos": "81", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"External ID. A general ID for identifying a portfolio, for example insurance number."},
{"pos": "82", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Status*. Select your portfolio's status between Active, Passive or Closed. The status allows you to categorize your portfolios, for example to differentiate between portfolios you are actively managing and portfolios you have already closed. Recommended status to use for portfolios you are actively working with is Active - such portfolios are shown everywhere in the system, and you can work with active portfolios on the Overview. Passive and Closed portfolios are not selectable on the Overview (to avoid cluttering the list of portfolios you are actively maintaining) - you can still access portfolios regardless of their status through the search views."},
{"pos": "83", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Changing the status doesn't \"remove\" the portfolio from the system, just hides it away from the Overview - you can, for example, still generate reports for passive portfolio through a group, portfolio's contact, or generate a report from the Portfolios view."},
{"pos": "84", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Valuation method*. Choose the valuation method of the portfolio:"},
{"pos": "85", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"FIFO"},
{"pos": "86", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Average price"},
{"pos": "87", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"FIFO with adjustments , Average price with adjustments – The \"with adjustments\" options use transaction types that control the market value of the positions with the transaction's trade amount, such as Private Equity transaction types."},
{"pos": "88", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Average price with separate items – The \"with separate items\" option valuates your portfolios with average price, but keeps track of original purchase dates."},
{"pos": "89", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"FIFO (combined) – The combined option valuates the portfolio based directly on transactions in the subportfolios."},
{"pos": "90", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Portfolio name*. Name of the portfolio."},
{"pos": "91", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Type*. Choose the portfolio type from the alternatives, which are defined in Preferences - Portfolio types. The portfolio type can be for example Investment portfolio or Insurance portfolio."},
{"pos": "92", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Aggregation of subportfolios. Choose the method to aggregate positions from subportfolios in reporting and analytics:"},
{"pos": "93", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Sum up values – Aggregate the position amounts without currency conversion. Use it if the subportfolio currencies are the same as the main portfolio currency."},
{"pos": "94", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Recalculate values – Aggregate transactions from subportfolios and convert the amounts to the portfolio currency (using the FX rate valid on the transaction date). Use this option if you have sub portfolios in different currencies than the main portfolio currency."},
{"pos": "95", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Locked. Allows you to Lock your portfolio to prevent anyone from manually adding, modifying or deleting transactions or trade orders within the portfolio. If you try to change the transaction or trade orders within a locked portfolio, you will be notified that Your portfolio is locked! Locking a portfolio allows you to freeze your portfolio's contents from manual modifications, or for example collateralize assets by moving them to a locked sub-portfolio to prevent making modifications to the collateral."},
{"pos": "96", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Even when your portfolio is locked, you can still execute trade orders that have already been marked as executable, run corporate actions, and import transactions and trade orders to your portfolio."},
{"pos": "97", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Custody. Choose the custody of the portfolio from the alternatives, which are defined by creating a new contact of the type Custody."},
{"pos": "98", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Book entry. Define the book entry number for the portfolio."},
{"pos": "99", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Currency*. Choose the default currency for the portfolios from the alternatives, which are defined by creating a new security of the type currency. The default currency of a portfolio defines the currency used when creating reports for the portfolio, and the transactions are recorded in the portfolio default currency."},
{"pos": "100", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Source. Define the method for determining the Close market price for the securities in this portfolio. The chosen method Default, Manual, Close 1, 2, 3, 4 or 5 describes, which prices saved for a security are taken into account when determining the close price for the securities in this portfolio. The market price source is defined on a security level, but if the source of a security is Default, the source can be overridden on a portfolio level (e.g. for certain portfolios, the Close 2 prices of securities can be used even though the securities are set to use the default close prices)."},
{"pos": "101", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Language. Choose the language to be used in portfolio reports from the alternatives, which are defined in Preferences - Language. The default language of a portfolio is the language of its primary contact. The language chosen for a portfolio determines, which language is used in the portfolio reports when creating a report: the reports are created in the language of the portfolio. The translations for the security and transaction types to different languages are defined in Preferences - Internationalization. If no language is selected, the reports are printed out in Finnish and the abbreviations defined for security and transaction types are used."},
{"pos": "102", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Juridical form*. Choose the juridical form from the alternatives, which are defined in Preferences - Juridical form. The default juridical form of a portfolio is the juridical form of its primary contact. The juridical form affects the taxation of certain transactions added to the portfolios: when creating corporate actions, the tax associated with these is defined as a combination of juridical forms and tax countries of the portfolio."},
{"pos": "103", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Tax country*. Choose the tax country from the alternatives, which are defined in Preferences - Countries. The default tax country of a portfolio is the tax country of its primary contact."},
{"pos": "104", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Creation date. Define the creation date of the portfolio."},
{"pos": "105", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Start-up date. Define the start-up date of the portfolio."},
{"pos": "106", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Update date. Define the update date of the portfolio."},
{"pos": "107", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Model portfolio. Choose a model portfolio for the portfolio, which is used in the portfolio rebalancing (an optional extra to FA Portfolio). When a model portfolio is linked to the portfolio, the portfolio can be rebalanced to match the model portfolio, and the system automatically creates trade orders to buy and sell securities."},
{"pos": "108", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Posting rule. Choose the posting rules used for the portfolio from the alternatives that are defined in Preferences > Bookkeeping > Posting rule. For more information, see Posting-based bookkeeping."},
{"pos": "109", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Posting date. Define a posting date."},
{"pos": "110", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Close type. Choose the close for the portfolio: No change, Depreciation, Depreciation and refund or Market value. The close type relates to Closing a portfolio: a close type can be set to a portfolio already in the portfolio information, and used for example to check the portfolio's closing values with the Book values (closing) report."},
{"pos": "111", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Accrued interest. Choose whether the accrued interest is calculated on the position level based on Transaction date (default) or based on Settlement date."},
{"pos": "112", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Transaction date – the accrued interest on a position is calculated until the selected report date. If the bond is bought, the paid accrued interest of the purchase is used as the accrued interest of the position until the settlement date of the purchase."},
{"pos": "113", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Settlement date – the accrued interest on a position is calculate until the settlement date. The settlement date is defined versus the selected report date using the bond's settlement date offset (if enabled), holiday calendar and business day convention. If the settlement date offset is not enabled on the bond security, the default value 0 is used."},
{"pos": "114", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Tags. Choose tags from the alternatives defined in Preferences - General - Tags. Tags can be defined in three different ways:"},
{"pos": "115", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Grouped tags (select one): you can select one tag from each tag group, grouped in separate dropdowns. Only one tag in each tag group can be chosen. To group tags in a dropdown, defined them with a hyphen as \"group - tag\"."},
{"pos": "116", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Grouped tags (select multiple): you can select multiple tags from each tag group, grouped as separate sets of checkboxes. You can check multiple tags within each tag group. To group tags as a set of checkboxes, defined them with a colon as \"group : tag\"."},
{"pos": "117", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info", "body":"Individual tags: search for individual tags by typing the tag in the field and choosing the correct tag from the list below the field - all available tags are shown from the downward arrow on the keyboard. You can select multiple individual tags."},
{"pos": "118", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Portfolio groups tab allows you to manage the static portfolio groups the portfolio belongs to and see which dynamic groups your portfolio is currently part of."},
{"pos": "119", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Available groups - list of portfolio groups the portfolio can be added to. The groups are listed with the group's name."},
{"pos": "120", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Current groups - list of portfolio groups the portfolio currently belongs to. The groups are listed with the group's name."},
{"pos": "121", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Dynamic groups - list of dynamic groups the portfolio currently belongs to. The groups are listed with the group's name."},
{"pos": "122", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"You can add new portfolio groups to the portfolio by selecting them from \"Available groups\" and clicking the >> button, when the group is transferred to \"Current groups\". Similarly, you can remove a portfolio group from the portfolio by selecting it from \"Current groups\" and clicking the << button, and the portfolio group is transferred back to \"Available groups\". You can also add portfolios to a portfolio group through the Groups view [link]."},
{"pos": "123", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"For dynamic groups, you can only see which dynamic groups your portfolio belongs to, but you cannot add or remove them. You can modify the dynamic group criteria through the Groups view, which then affects which portfolios are dynamically part of the group."},
{"pos": "124", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"IDs tab allows you to define external IDs for the portfolio. These IDs are used by other parties to identify the portfolio, and can be used for example in importing transactions to the portfolio or reconciling the portfolio against an external source."},
{"pos": "125", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"Add a new ID with the Add ID button, and define the ID information in the fields. A red star indicates a mandatory field:"},
{"pos": "126", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"External name*. The name of the ID (or who uses the ID, where is it from). When starting to type in an ID, the system automatically suggests ID names you have used previously."},
{"pos": "127", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"External ID*. The external ID for the portfolio."},
{"pos": "128", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Memo allows you to write optional information, notes or observations related to the portfolio. The contents of the memo are also shown in the Memo section on the Overview, when the portfolio is selected."},
{"pos": "129", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"The Memo is divided into different parts, which can be used to write different kinds of notes and information:"},
{"pos": "130", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Memo. Notes written in memo can be seen on the Overview, when the portfolio is selected."},
{"pos": "131", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Explanation, Info 2 and Info 3 . Additional text fields that can be seen on the Overview, when the portfolio is selected."},
{"pos": "132", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Description . The contents of the description field can only be seen in the Portfolio window, not on the Overview."},
{"pos": "133", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"You can also import texts to the memo from a file through Import - Import portfolio memo, or to edit the contents of the memo directly from the Memo section on the Overview."},
{"pos": "134", "title":"Contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#contacts", "body":"Contacts tab allows you to choose the contact(s) of the portfolio as well as subportfolio(s) to the selected portfolio. The contact tab allows you to define your contact \/ portfolio structure visible on the Overview: in addition to having a contact with portfolios, you can also modify the structure by adding secondary contacts to a portfolio as well as dividing a portfolio into subportfolios."},
{"pos": "135", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"Selecting a contact for the portfolio is an important part when creating a portfolio: the contact of the portfolio identifies the owner of the portfolio. The Contacts tab allows you to define:"},
{"pos": "136", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"Primary contact - the primary \/ main owner of the portfolio (marked with a star on the contact listing). The primary contact is the main or \"legal\" owner of the portfolio, and various information is often picked from the portfolio's primary contact. The portfolio is also always shown under the primary contact on the Overview."},
{"pos": "137", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"Other contacts - in addition to the primary contact, you can also link other contacts to your portfolio. For example, for insurance portfolios, the primary contact is often the insurance company, while the private person taking the insurance can be linked as an other contact."},
{"pos": "138", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"The portfolio's contacts are listed on the left side of the window, and the portfolio's primary contact is marked with a star. You can add a new contact with the Add contact button, and you can view and modify the information of an existing contact by selecting the contact from the list. You can de-link the selected contact from the portfolio with the Delete button below the contact information."},
{"pos": "139", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"When creating a new portfolio, the first contact you add to the portfolio is marked added as the primary contact of the portfolio, and the primary contact is by default set to be the contact you had selected on the Overview. You can change the primary contact of a portfolio by de-linking the current primary contact from the portfolio, when the first contact on the list will be marked as the primary contact."},
{"pos": "140", "title":"Selecting subportfolios", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-subportfolios", "body":"Subportfolios allow you to add subportfolio(s) to the portfolio you are editing - the portfolio you are editing becomes the \"main\" portfolio, and the subportfolios you add will be shown below it in you portfolio hierarchy."},
{"pos": "141", "title":"Selecting subportfolios", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-subportfolios", "body":"The portfolio's subportfolios are listed on the left side of the window. You can add a new subportfolio with the Add subportfolio button, and you can view and modify the information of an existing subportfolio by selecting the subportfolio from the list. You can de-link the selected subportfolio with the Delete button below the subportfolio information."},
{"pos": "142", "title":"Asset managers", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#asset-managers", "body":"The Asset managers tab allows you to add asset managers to the portfolio. You can only choose existing contacts as asset managers of a portfolio. Whereas Contacts determines who owns the portfolio, Asset managers determine who manages and is responsible for the portfolio. Asset managers can, for example, be used in restricting access to portfolios through limited visibility."},
{"pos": "143", "title":"Asset managers", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#asset-managers", "body":"The portfolio's asset managers are listed on the left side of the window - choose the asset manager from the list to view or delete it. Add a new asset manager to the portfolio with the Add asset manager button below the asset manager listing. Choose the asset manager from the drop-down menu on the right side of the window, and add the chosen asset manager to the portfolio from the Add asset manager button below the asset manager information."},
{"pos": "144", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"The Accounts tab allows you to add different kinds of accounts to your portfolio. Accounts allow you to follow your portfolio's cash balance, and when linking transactions to an account, the system automatically keeps track of your account balance. Accounts are not mandatory to add when creating a portfolio, however if you want to be able to follow the cash balance of your portfolio, you need to add at least one cash account to your portfolio."},
{"pos": "145", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"The account on the top of the list considered as the default account of the portfolio, and all the transactions are by default created against this account. If you want to create transactions against another account than the default account, you often need to specifically select it. You can modify the order of the accounts by dragging an account to the desired place in the account listing. The order of the accounts affects the order the accounts are shown on the Overview and different reports."},
{"pos": "146", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"A portfolio can have one or more accounts: the existing accounts are listed on the left side of the window. Add a new account with the Add account button, and define the account information in the available fields. A red star indicates a mandatory field."},
{"pos": "147", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"The fields available are:"},
{"pos": "148", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Account no.*. The account number, for example the bank account number."},
{"pos": "149", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Currency*. The account currency from the alternatives, which are defined as securities of the type Currency."},
{"pos": "150", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Name*. The name for the account."},
{"pos": "151", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"BIC-code. The BIC code of the account."},
{"pos": "152", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Issuer. The issuer for your account from the Issuer type contacts defined in the system. Linking an issuer to your account allows you to keep track of who has issued the account. This is especially useful when analyzing your portfolio’s investments by issuer, when accounts and other investments are grouped similarly."},
{"pos": "153", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Secondary account no. A secondary account number to the account."},
{"pos": "154", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Category. The account category. When starting to type in a category, the system automatically suggests categories you have used previously."},
{"pos": "155", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Mandate reference. The mandate reference of the account."},
{"pos": "156", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Calendar (day count convention). The day count convention for the account. The day count is used to convert dates to a numeric representation for financial maths, and can be used in calculating accrued interest on the account with a custom formula"},
{"pos": "157", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Fixing. The annual fixing as a percentage %. Fixing can be used in calculating accrued interest on the account with a custom formula."},
{"pos": "158", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Base instrument. The base instrument from the securities defined in the system. Base instrument can be used in calculating accrued interest on the account with a custom formula."},
{"pos": "159", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Spread. The spread added to the values from the base instrument as a percentage %. Spread can be used in calculating accrued interest on the account with a custom formula."},
{"pos": "160", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Cash account (part of portfolio's cash). Indicates if the account is considered as a Cash account or as Other account (available from FA 2.3 onward). By default, accounts are marked as cash accounts, but you can disable this selection to make your account appear as an other account. This allows you to distinguish between actual cash accounts and other accounts that are used to track commitments, accrued fees, etc. Cash accounts and other accounts are also grouped separately within FA, for example on the Overview."},
{"pos": "161", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Hide if balance is zero. Hides the account on the Overview and Positions reports when the account balance is zero. The account is shown only when there is some balance, and prevent showing empty accounts with zero balance in the portfolio. By default, accounts are defined not to be hidden."},
{"pos": "162", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to primary contact's portfolios \/ Shared to all parent portfolios'subportfolios. Account sharing options:"},
{"pos": "163", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to all linked contact's portfolios indicates that the account is shared to all portfolios of all contacts that are linked to this porfolio."},
{"pos": "164", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to primary contact's portfolios indicates that the account is shared to all portfolios where the same customer is the primary contact. This option lets you chose the account for transactions in other portfolios of the same customer."},
{"pos": "165", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to all parent portfolios' subportfolios indicates that the account is shared only to parent portfolio's subportfolios."},
{"pos": "166", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"By default, these sharing options are off. Accounts are shared only to subportfolios of the current portfolio."},
{"pos": "167", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"You can use shared accounts when you create transactions manually or by importing. Also, shared accounts are used by the system when it creates transactions through corporate actions or trade order execution and when it creates trade orders through rebalancing. FA first checks if the portfolio has its own accounts that can be used, and if not, then checks if the portfolio has shared accounts that can be used."},
{"pos": "168", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Visibility (include account in reports). Indicates if the account is visible on the Overview and other views, taken into account on all portfolio reports, and available as a criterion when defining dynamic groups. The visibility is chosen as a default for all accounts. If an account is defined as hidden (i.e. not visible), then the account is ignored in all calculations."},
{"pos": "169", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Exclude balance from portfolio's total. Check if you want the account to be shown in your positions, while its balance is not included in the total market value (or other total values) of your portfolio. By default, accounts are not excluded from portfolio's total. This option is useful for example in tracking total capital added to an insurance contract and profits taken out - account is shown within your position, but the account balance is not added up to your portfolio's total value."},
{"pos": "170", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to all linked contacts' portfolios. Indicates if the account is shared among all the portfolios where the same contact is linked as a contact. The functionality is otherwise the same as in \"Shared to primary contact's portfolios\" - the first option considers only primary contacts, while the latter option considers all linked contacts when determining which portfolios the account is shared to."},
{"pos": "171", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Account tags . Account tags from the alternatives defined in Preferences - General - Tags. Tags can be defined in the following ways:"},
{"pos": "172", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Grouped tags (select one): you can select one tag from each tag group, grouped in separate drop-downs. Only one tag in each tag group can be chosen. To group tags in a drop-down, defined them with a hyphen as \"group - tag\"."},
{"pos": "173", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Grouped tags (select multiple): you can select multiple tags from each tag group, grouped as separate sets of checkboxes. You can check multiple tags within each tag group. To group tags as a set of check boxes, defined them with a colon as \"group : tag\"."},
{"pos": "174", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Individual tags: search for individual tags by typing the tag in the field and choosing the correct tag from the list below the field - all available tags are show from the downward arrow on the keyboard. You can select multiple individual tags."},
{"pos": "175", "title":"Reporting", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting", "body":"Reporting tab allows you to define the information related to whom this portfolio should be reported to, and information needed to sending reports via email."},
{"pos": "176", "title":"Reporting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-contacts", "body":"You can set one or more contacts as \"reporting contacts\", or contacts to whom this portfolio should be reported to. All the reporting contacts are listed on the left side of the window based on the name of the contact. The primary contact of the portfolio is marked with a star, and the primary contact is a default reporting contact."},
{"pos": "177", "title":"Reporting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-contacts", "body":"Choose a contact from the list to view or delete it. Add a new reporting contact to the portfolio with the Add reporting button below the contact listing. Choose the contact from the drop-down menu on the right side of the window, and add the chosen contact to the portfolio from the Add reporting button below the asset manager information."},
{"pos": "178", "title":"Reporting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-contacts", "body":"The reporting contact is \"nice-to-know\" information, and it is not directly used by the system in reporting. For example, when sending reports via email per customer, the customers the email is sent to is picked up from portfolio contacts, not reporting contacts."},
{"pos": "179", "title":"Reporting email addresses", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-email-addresses", "body":"When sending reports via email per portfolio, the generated reports are sent to the email addresses listed within the Reporting tab. If not email address is defined, no reports are sent to this portfolio via email."},
{"pos": "180", "title":"Reporting email addresses", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-email-addresses", "body":"The available fields are:"},
{"pos": "181", "title":"Reporting email addresses", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-email-addresses", "body":"Email addresses. The email addresses to send out this portfolio's reports when sending reports via email per portfolio. This field is useful if you want to define per portfolio who should receive this portfolio's reports, especially if you want to send to reports to a contact not found in the system. You can define several email addresses in this field, just separate the addresses with a comma."},
{"pos": "182", "title":"Fees", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#fees", "body":"Fees tab allows you to define the different default fees related to the transactions created to the portfolio."},
{"pos": "183", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Cost types allow you to associate different fees to your portfolio - a fee always consists a type (i.e. what kind of a fee this is), and a fee value (i.e. 1%). The fees you associate with your portfolio are often used as parameters in your fee formulas, in other customizations you have in your system, or as \"nice-to-know\" information on your portfolio's fees."},
{"pos": "184", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"In addition, specific fee types are used when calculating fees to trade orders in Rebalancing, when calculating costs for trade orders in Trade order execution, and when manually entering transactions in the Transaction window. You can use the fees of the type \"transaction\" by typing a question mark (?) to the Fee field in the Transaction window - the system automatically calculates the fee for the transactions by using the defined \"transaction\" fee percentage from the portfolio."},
{"pos": "185", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"The fees added to your portfolio are listed on the left side of the window: you can associate any fee type defied in Preferences - Fee calculation - Portfolio cost types and a portfolio-specific fee percentage to your portfolio. Choose a fee from the listing to view or delete it, and add a new fee to your portfolio with the Add button below the listing. Fill in the account information in the available fields."},
{"pos": "186", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"The available fields are:"},
{"pos": "187", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Cost type - choose the cost type of the fee from the alternatives, which are defined in portfolio cost type preferences (to learn more, see Preferences - Fee calculation). The type determines what kind of a fee you are adding, and different types of fees might be considered differently within you system."},
{"pos": "188", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Name - shows the name of the chosen cost type."},
{"pos": "189", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Type - shows the type of the chosen cost type."},
{"pos": "190", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Value - define the value of the fee - usually, the fees are defined as percentages (i.e. 1,00 means 1%)."},
{"pos": "191", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Cost formulas you link to your portfolio are used in Fee calculation, for example when calculating the Asset management fee for the portfolio."},
{"pos": "192", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"The cost formulas linked to your portfolio are listed on the left side of the window: you can link any cost formula defined in Cost formula Preferences to your portfolio (to learn more, see Preferences - Fee calculation). Choose a fee from the listing to view or delete it, and add a new fee to your portfolio with the Add button below the listing. Fill in the account information in the available fields."},
{"pos": "193", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"The fields available are:"},
{"pos": "194", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Cost formula – choose the cost type of the fee from the alternatives, which are defined in cost formula preferences (to learn more, see Preferences - Fee calculation). The formula determines how \/ with what logic the fee is calculated to the portfolio. The eye icon next to the field allows you to preview the the logic \/ code of the formula."},
{"pos": "195", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Name – shows the name of the chosen cost formula."},
{"pos": "196", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Code – shows the code of the chosen cost formula."},
{"pos": "197", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Transaction type - shows the transaction type associated with the selected cost formula: which transaction type the formula is associated with."},
{"pos": "198", "title":"Benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#benchmark", "body":"Benchmark tab allows you to define a benchmark index to your a portfolio in two ways: you can either define a portfolio-specific benchmark index, or link a general benchmark index to your portfolio (for details, see Preferences - Portfolios)."},
{"pos": "199", "title":"Benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#benchmark", "body":"Benchmark indices are used to compare the performance or return of a portfolio to an index. You can define benchmarks that consist of a single index, or composite benchmarks that consist of a combination of different indices (e.g. a portfolio's performance can be compared to an index which is a composite of 40 % index A and 60 % index B). In addition, if your benchmark consists of indices in other currency than your portfolio's currency, the index values are converted to your portfolio's currency with a relevant FX rate. The benchmark index linked to a portfolio is visible for example on some P\/L reports and in Analytics."},
{"pos": "200", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"A portfolio-specific benchmark is used only for this one portfolio - any changes you make to the content of the benchmark affect only this one portfolio."},
{"pos": "201", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"When defining a benchmark, first select the date from which the benchmark is valid from for the portfolio and Add it to your benchmark definition. The start date should usually be set as the start date of your portfolio (i.e. when the portfolio starts getting in transactions) - if the benchmark starts later than your portfolio, then the benchmark will be shown as a flat line until the date it is valid from. If you want to update your benchmark's content, add a new date to it - the new content will be valid from the new date onward, while the prior index content will be used until the new date."},
{"pos": "202", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"Below each date you can see the content of the benchmark index. You can Add a new position for the index under the selected date: you need to define the security the index follows and the share of this security from the whole index. For each new position under the selected date, choose the index security from the drop-down menu. In the field next to the security, define the share of the selected security of the whole index. If the index follows a single security, define the share as 100 % - if the share of the selected security is less than 100, you have to create new positions and define their shares so that the sum of the shares of different securities under one date equals 100."},
{"pos": "203", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"In addition, you can Copy model portfolio benchmark. If a Model portfolio is linked to the portfolio in the Basic info tab, and if a benchmark index is defined to the portfolio linked to the model portfolio in Model portfolio window, the benchmark index can be fetched from the model portfolio's linked portfolio and added to your portfolio. The option is only available, if a model portfolio is linked to the portfolio, and a benchmark index can be found from the model portfolio."},
{"pos": "204", "title":"General benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#general-benchmark", "body":"You can also set a general benchmark index to your portfolio instead of defining a portfolio-specific benchmark index. You can choose a general benchmark from the options you have defined in Benchmark index Preferences (see Preferences - Portfolios). The benchmark index information of the selected index is shown at the bottom of the window."},
{"pos": "205", "title":"Current benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#current-benchmark", "body":"The Current benchmark tab shows the benchmark values on the specified date."},
{"pos": "206", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"Strategy tab allows you to define a strategy for your portfolio, similar to defining an allocation to a security. Strategies can be used to follow your portfolio's allocation against your portfolio's strategy and see whether your portfolio's contents are following your strategy. Make sure you have also allocated your securities with same asset classes and types for comparison to work!"},
{"pos": "207", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"A strategy consists of asset types (defined in Asset classes and types Preferences) with percentage shares of how many percentages each asset type constitutes of the entire strategy. In addition to defining fixed shares, you can also define the minimum and maximum shares for each asset type."},
{"pos": "208", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"Your portfolio can contain multiple strategies, allowing you to easily define and maintain different strategies for example for asset allocation, geographical allocation and industrial allocation. You can manage your portfolio's strategy the same way you manage your security's allocations, with the addition of being able to define a Min share % and Max share % for each asset type. Each strategy consists of asset types from one allocation group, allowing you to maintain separate strategies from different points-of-views. (Available from FA 3.7 onward)"},
{"pos": "209", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"Prior to FA 3.7, your portfolio contained one strategy, which was defined combining asset types from different allocation groups. For example, your strategy could have been 90% Europe (Geographical allocation), 10% Other (Geographical allocation) and 100% Equity (Asset allocation) - after FA 3.7, this is instead interpreted as two strategies, one for Geographical allocation and one for Asset allocation."},
{"pos": "210", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"Investment plan allows you to define an investment plan for the portfolio - the user interface works similarly to defining a benchmark index or a strategy to a portfolio. You can use your portfolio's investment plan as a portfolio-specific model when rebalancing your portfolios."},
{"pos": "211", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"An investment plan consists of securities with percentage shares of how many percent each security constitutes of the entire plan. Investment plan essentially allows you to define which individual instruments you want to invest in, and how big of a share out of your portfolio total you want to target to invest in a specific security. If you want to include portfolio's account as a position in your investment plan, add the currency of the account as a security in the plan. See also Including portfolio's cash in model portfolios."},
{"pos": "212", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"In addition to defining target shares for each position, you can also define the minimum and maximum shares for each security. This allows you to define minimum and maximum “thresholds” for each position, or how much you'd allow your position to deviate or drift from your target. For example, you can add an instrument to your plan with target 10%, min threshold 9% and max threshold 11%. (Available from FA 3.8 onward)"},
{"pos": "213", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"Minimum and maximum thresholds are validated, ensuring they align with your target - if you have defined either Min share % or Max share % , your Min share % should be smaller or equal to target Share %, and Max share % should be larger or equal to target Share %. Thus, should always define both minimum and maximum threshold (if you only define a Max share %, leaving the Min share % untouched interprets 0% minimum threshold). If you try to save invalid min and max thresholds, you are presented with a warning Min and max shares should be consistent with the target share % and prevented to save invalid thresholds. You can also choose not define minimum and maximum shares in your investment plan - if you leave both min and max untouched (i.e. both min and max share are 0), they are shown with a hyphen \"-\" in your plan."},
{"pos": "214", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"Investment plan does not have to add up to 100%, allowing you to define partial or leveraged investment plans. However, if your investment plan doesn't add up to 100%, you are presented with a question \"Positions in your investment plan add up to xx %. Do you want to save your investment plan even though it does not add up to 100 %?\" to prevent you from unintentionally saving non-complete investment plans."},
{"pos": "215", "title":"Limits", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#limits", "body":"The Limits tab allows you to link, analyze and monitor limits, or investment constraints on your portfolio."},
{"pos": "216", "title":"Limits", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#limits", "body":"For more information, see Limits and limit monitoring."},
{"pos": "217", "title":"Key figures", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#key-figures", "body":"The Key figures tab allows you to store a time series of values of your choice - you can for example store fee percentages that change over time. For more details, see Key figures for contacts, portfolios and securities."},
{"pos": "218", "title":"Documents", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#documents", "body":"The Documents tab allows you to manage documents related to your portfolios. For more information, see Document management."},
{"pos": "219", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Saving a portfolio saves the portfolio into the system, and after you save the portfolio, you can for example create transactions to it. When editing the information of an existing portfolio, usually the system just updates the portfolio information - the updated information is picked up by the system automatically."},
{"pos": "220", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"However, if you modify Valuation method or Source field value within the Basic info, modify your portfolio's accounts within the Accounts tab, or change your portfolio's benchmark within the Benchmark tab, the system automatically triggers a report recalculation to update the effect of the change into your portfolio's positions."},
{"pos": "221", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"At the bottom of the Portfolio window, you can:"},
{"pos": "222", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Save and close – saves the portfolio \/ the changes made to the portfolio information and closes the window."},
{"pos": "223", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Save – saves the changes made to the portfolio information, and takes you back to the Basic info tab."},
{"pos": "224", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Copy as new – copies all of the existing portfolio's information as a base for you to create a new portfolio with a new ID. This function copies all other portfolio information except for the Portfolio ID, External ID and entries in the IDs tab, since these are portfolio-specific and related to only one single portfolio."},
{"pos": "225", "title":"Related links", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#related-links", "body":"Manage portfolios, positions, and accounts in FA User guide"}]