[{"pos": "1", "title":"Preferences - Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html", "body":"Portfolio preferences include relevant preferences for managing portfolios. These preferences allow you to set the options available in the fields when defining the basic information of a portfolio in the Basic info tab on the Portfolio window. The options you set up in these preferences allow you to flexibly group your portfolios. In addition, rebalancing preferences allow you to set up preferences for rebalancing."},
{"pos": "2", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"Benchmark indices are used to compare the performance or return of a portfolio to an index. The benchmark index linked to a portfolio is visible, for example, in some P\/L reports, and in Analytics Plus. Benchmark indices can be:"},
{"pos": "3", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"Single or composite. Single benchmarks consist of one index. Composite benchmarks consist of a combination of different indices (for example, a composite of 40 % index A and 60 % index B)."},
{"pos": "4", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"Regular or interpolated. Regular benchmarks are based on the dates and position shares that you entered. For example, you can set a benchmark that is valid from 01.01.2022 and contains 20% of a certain stock. Then, you can raise the position share, for example, to 22% starting from 01.03.2023, and so on. Interpolated benchmarks are based on the position shares on the start and end date of the period. The values between the dates are calculated by the system to create a gradual daily change. For example, if you want to reduce investments in a particular sector from 30% to 20% over 5 years, you can enter two dates and specify the start and end position shares. The values in between the dates will be calculated automatically."},
{"pos": "5", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"General or portfolio-specific. General benchmark indices are defined in Preferences. You can then apply them to a portfolio by choosing a general benchmark in the Portfolio window, Benchmark tab. Portfolio-specific benchmarks are defined per portfolio in the Portfolio window."},
{"pos": "6", "title":"Benchmark index", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-index", "body":"If multiple portfolios follow the same benchmark index, it is worth defining a general benchmark index. Also, any modifications made to the general benchmark index affect the portfolios linked to the index."},
{"pos": "7", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"The benchmark index information is defined in the fields on the right side of the window: a red star indicates a mandatory field."},
{"pos": "8", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Benchmark index name*"},
{"pos": "9", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"The name of the benchmark index."},
{"pos": "10", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Date"},
{"pos": "11", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"The date from which the benchmark index is valid in a portfolio. This is usually the start date of your portfolio (when the portfolio starts getting in transactions). If you have a regular benchmark, define one date and enter the position shares. You can later update the benchmark by adding a new date and re-defining the index positions. The updated index is valid from the new date onward. If you have an interpolated benchmark, you need to enter at least two dates: start date and end date of the change. For example, if you set a start date to 8.10.2022, the position shares get changed on 9.10.2022."},
{"pos": "12", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Interpolate shares between dates"},
{"pos": "13", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Whether a benchmark is interpolated."},
{"pos": "14", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"Holiday calendar"},
{"pos": "15", "title":"Benchmark parameters", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-parameters", "body":"For an interpolated benchmark, set the holiday calendar to use. Position shares change only on business days."},
{"pos": "16", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Under each date in the table, you can see the index content. To add a position, click Add in the table row."},
{"pos": "17", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Date"},
{"pos": "18", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"See the Date field description above."},
{"pos": "19", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Security"},
{"pos": "20", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"The security the index follows. If you add securities in other currency than the portfolio's currency, the index values are converted to your portfolio's currency with a relevant FX rate."},
{"pos": "21", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"For interpolated benchmarks, the start and end date indices must contain the same set of securities. If you want a position to be sold out gradually, add it with 0% weight on the end date."},
{"pos": "22", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"Share %"},
{"pos": "23", "title":"Benchmark content", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#benchmark-content", "body":"The position share in the index. Position shares of different securities under one date must sum up to 100."},
{"pos": "24", "title":"Limit definitions", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#limit-definitions", "body":"Limit definition preferences allow you to define limits, or investment constraints, that you can link to your portfolios for limit monitoring. For more information, see Limit definitions."},
{"pos": "25", "title":"Portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolio-types", "body":"In the Portfolio type preferences you can define the portfolio types available for portfolios. Portfolio types are used to categorize the portfolios: for example, the portfolios could be divided into investment portfolios and insurance portfolios. For portfolio, a portfolio type is mandatory."},
{"pos": "26", "title":"Portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolio-types", "body":"Portfolio types can be defined in the Portfolio type window in the Preferences. A portfolio type consists of a code and a name: the code is used to identify the portfolio type in the system, and the name is used to view and choose the portfolio type in the user interface."},
{"pos": "27", "title":"Restricting access to portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#restricting-access-to-portfolio-types", "body":"Portfolio types also support restricting them to be shown only to specific user roles, allowing you to restrict the list of available portfolio types per user role within the Portfolio type dropdown in the Portfolio window's Basic information and Portfolio view's extended search fields. For example, you can decide which user role(s) are allowed to use which portfolio types for the portfolios they manage, especially useful in restricting the visibility of custom fields linked to a certain portfolio type."},
{"pos": "28", "title":"Restricting access to portfolio types", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#restricting-access-to-portfolio-types", "body":"If you want to restrict a portfolio type to be shown to only certain user role(s), you can do this by checking the appropriate roles within the portfolio type preferences - once checked, the type will be available only to the users with the selected role(s). If you don’t restrict a portfolio type to a specific user role, it will be visible to all users."},
{"pos": "29", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Portfolios preferences allow you to enable different settings related to portfolios."},
{"pos": "30", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Generate a running number for portfolio ID automatically"},
{"pos": "31", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"When enabled, a running number is automatically created for a new portfolio as the portfolio ID, starting from number 1. When enabled, the next available number is set as the portfolio ID in the Portfolio window."},
{"pos": "32", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Show memos for the selected customer's all portfolios on the overview"},
{"pos": "33", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"When enabled, the Memo section on the Overview shows the memos for all of the selected customer's portfolios at the same time, instead of showing only the memo of the selected customer or portfolio."},
{"pos": "34", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Enabling this might slow down opening customers with lots of portfolios under them on the Overview."},
{"pos": "35", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"Define the maximum number of portfolios shown in \"Portfolio hierarchy\" tree on the Overview"},
{"pos": "36", "title":"Portfolios", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#portfolios", "body":"You can configure how many portfolios are shown in the \"Portfolio hierarchy\" section on the Overview, allowing you to control how many portfolios are shown for example when viewing a large portfolio group. By default, 500 portfolios are shown."},
{"pos": "37", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"In the rebalancing preferences you can define the \"method\" for creating trade orders from rebalancing as well as the transaction types used in creating buy and sell trade orders when rebalancing a portfolio."},
{"pos": "38", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"First, define the \"method\" trade orders are created by rebalancing."},
{"pos": "39", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Create trade orders based on trade amount (calculate unit price based on amount and difference)"},
{"pos": "40", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose this option if you want to fix the amount and trade amount of the trade orders created by rebalancing and adjust the unit price to match amount * unit price = trade amount (default option). With this option, you will end up with trade orders that should be executed \"with trade amount\", since the trade amount equals the difference in the position between the rebalanced portfolio and the model portfolio."},
{"pos": "41", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Create trade orders based on amount (calculate trade amount based on amount and market unit price)"},
{"pos": "42", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose this option if you instead want to fix the amount and unit price of the trade orders created by rebalancing and adjust the trade amount to match amount * unit price = trade amount. With this option, you will end up with trade orders that should be executed \"with amount\", since the amount and unit price equal the difference in the position between the rebalanced portfolio and the model portfolio on the rebalancing date."},
{"pos": "43", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Despite the \"method\" you selected, the trade orders are formed with the same logic, and the amount is always calculated in the same way - this selection determines whether the final trade orders are created by adjusting the unit price or trade amount to achieve valid calculations for amount * unit price = trade amount."},
{"pos": "44", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Below, define the transaction types used for the created trade orders, and when the trade orders are executed, for the transactions recorded to the portfolios."},
{"pos": "45", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Select the transaction type for \"buy\" trade orders (mandatory)"},
{"pos": "46", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose the transaction type used to create buy trade orders from rebalancing. This is the transaction type used for all buys."},
{"pos": "47", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Select the transaction type for \"sell\" trade orders (mandatory)"},
{"pos": "48", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose the transaction type used to create sell trade orders from rebalancing. This is the default transaction type used for sells."},
{"pos": "49", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Select the transaction type used for trade orders when selling an entire position (optional, if not defined, then the selected \"sell\" type is used)"},
{"pos": "50", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Choose the transaction type used for sell trade orders when rebalancing creates a sell trade order based on units instead of trade amount, for example when selling away an entire position from a portfolio. If left empty, the selected sell type is used for all kinds of sell trade orders."},
{"pos": "51", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Below, you can define a target range for portfolio's cash balance or buffer for cash to ensure positive cash balance. These preferences specifically affect what kind of trade orders are created when rebalancing is restricted to accounts."},
{"pos": "52", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define target range for portfolio's cash balance (when rebalancing cash, portfolio is rebalanced only if cash is outside of the target range)"},
{"pos": "53", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define a target range, or minimum and maximum, for portfolio's cash balance: when restricting rebalancing to accounts, portfolio is rebalanced and trade orders created only if cash is outside of the defined target range. You can for example define that if there is between $0 and $10 on your account, portfolio would not be rebalanced at all to avoid unnecessarily small trades when there is only a little cash. Defaults for minimum and maximum are 0, resulting in target range of 0 cash balance."},
{"pos": "54", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Minimum (in currency) - define a minimum in currency for your target range."},
{"pos": "55", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Maximum (in currency) - define a maximum in currency for your target range"},
{"pos": "56", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much negative cash balance is increased by to cover all negative cash"},
{"pos": "57", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much negative cash balance is increased by when restricting rebalancing to accounts in order to ensure positive cash balance after all trades have gone through, even if market fluctuates unfavorably. You can define the buffer both as percentage and in currency, when the system would use the value resulting in a larger buffer. For example, if you have -100€ on your account and icrease defined as 2% (buffer 100€ * 2% = 20€) and 10€, rebalancing would use cash worth -100€ - 20€ (larger buffer used, 20€ > 10€) = -120€, i.e. rebalancing would sell worth a bit more to ensure negative balance will be covered."},
{"pos": "58", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Increase as percentage (%) - define the increase as percentages."},
{"pos": "59", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Increase in currency - define the decrease directly in currency"},
{"pos": "60", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much positive cash balance is decreased by to ensure positive cash balance"},
{"pos": "61", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how much positive cash balance is decreased by when restricting rebalancing to accounts in order to ensure positive cash balance after all trades have gone through, even if market fluctuates unfavourably. You can define the buffer both as percentage and in currency, when the system would use the value resulting in a larger buffer. For example, if you have 100€ on your account and decrease defined as 2% (buffer 100€ * 2% = 20€) and 10€, rebalancing would only use cash worth 100€ - 20€ (larger buffer used, 20€ > 10€) = 80€."},
{"pos": "62", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Decrease as percentage (%) - define the decrease as percentages."},
{"pos": "63", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Decrease in currency - define the decrease directly in currency."},
{"pos": "64", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Below, you can define a limit for cash from sells used for buys. This allows you to be more conservative when doing a full rebalance: expected cash from sell orders is used to generate buys within the rebalance on one go, but sell orders' values are not counted for as 100% but for example as 90% or 95%. With this, even if prices drop between the time of the rebalance and the time of the execution of your sell orders (and you don't end up getting as much cash from your sells as originally expected), you most likely will get enough cash from your sells to execute your buys (since buys were not generated expecting 100% from your sells but a smaller percentage such as 90% or 95%)."},
{"pos": "65", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define how many percent (%) of cash from sells can be used to buy with"},
{"pos": "66", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Define as a number between 0 and 100. Default is 100, indicating that 100% of cash from sells is used to generate buy orders with. This setting is considered when you use a rebalance method that \"buys with cash from sells\": this setting limits how big a share of the sell's value is used to generate buy orders."},
{"pos": "67", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"You can also select what kind of a position listing the summary of the rebalance is shown."},
{"pos": "68", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Aggregate positions in the rebalance window"},
{"pos": "69", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Allows you to determine how you want the rebalancing window to show your positions, whether you want to aggregate positions or whether you want to group positions per portfolio."},
{"pos": "70", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"If enabled, positions of all rebalanced portfolios are aggregated (summed up): one row is shown for each position, and the values on the row sum up all positions for that security."},
{"pos": "71", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"If disabled, positions are grouped by portfolio."},
{"pos": "72", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Finally, you can enable rebalancing with real-time 15 minutes delayed prices, fetched with a corresponding Market Price Connector from SIX. This allows you to utilize the 15 minutes delayed real-time market price feed from SIX to get more up-to-date results from rebalancing your portfolios – the more up-to-date your prices are, the more accurate is the prediction on how much to buy or sell."},
{"pos": "73", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Rebalancing with 15min delayed prices"},
{"pos": "74", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Allows you to rebalance your portfolios with 15 minutes delayed real-time prices. Every time you trigger a rebalance on your portfolio(s), the market price connector fetches the latest available prices for all your positions' securities directly from SIX, and uses the prices when calculating your trade orders."},
{"pos": "75", "title":"Rebalancing", "document":["FA Back reference"], " ":[], "url":"preferences---portfolios.html#rebalancing", "body":"Rebalancing will always use the latest available price it can find - if you the connector to SIX is not enabled, or if you for some reason don't get a price through the connector for a security, then the latest available price stored in FA is used. Also, prices fetched from SIX are converted to portfolio currency with latest fx rates stored in FA when necessary."},
{"pos": "76", "title":"Portfolio window", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html", "body":"Portfolio window allows you to create a new portfolio or to view and edit the information of existing portfolios. You can create a new portfolio through the menu in New - New portfolio, and you can view the information of existing portfolios by double-clicking a portfolio either from your search result on the Portfolios view or from the Overview."},
{"pos": "77", "title":"Portfolio window", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html", "body":"The basic information for the portfolio is defined in the Basic info tab, and other tabs are used to define additional information for the portfolio. Remember to check that the portfolio has a customer as a primary contact in the Contacts tab, and if you are tracking cash balances in your portfolio, remember to add appropriate accounts in the Accounts tab."},
{"pos": "78", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Basic info tab allows you to define the basic information of the portfolio, such as ID and name. A red star indicates that a field is mandatory."},
{"pos": "79", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"The available fields are:"},
{"pos": "80", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Portfolio ID*. An individual ID defined for a portfolio. The portfolio ID separates a portfolio from other portfolios (the system does not allow more than one portfolio with a same portfolio ID). The portfolio ID is used to identify and search for a portfolio, and many of the Import functions utilize the portfolio ID. When creating a new portfolio, if the \"Generate a running number for portfolio ID automatically\" is enabled in Portfolios Preferences, the next available number is automatically set as the portfolio ID. Best practice is not to include special characters into the portfolio ID - only use numbers and letters (a-z)."},
{"pos": "81", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"External ID. A general ID for identifying a portfolio, for example insurance number."},
{"pos": "82", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Status*. Select your portfolio's status between Active, Passive or Closed. The status allows you to categorize your portfolios, for example to differentiate between portfolios you are actively managing and portfolios you have already closed. Recommended status to use for portfolios you are actively working with is Active - such portfolios are shown everywhere in the system, and you can work with active portfolios on the Overview. Passive and Closed portfolios are not selectable on the Overview (to avoid cluttering the list of portfolios you are actively maintaining) - you can still access portfolios regardless of their status through the search views."},
{"pos": "83", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Changing the status doesn't \"remove\" the portfolio from the system, just hides it away from the Overview - you can, for example, still generate reports for passive portfolio through a group, portfolio's contact, or generate a report from the Portfolios view."},
{"pos": "84", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Valuation method*. Choose the valuation method of the portfolio:"},
{"pos": "85", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"FIFO"},
{"pos": "86", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Average price"},
{"pos": "87", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"FIFO with adjustments , Average price with adjustments – The \"with adjustments\" options use transaction types that control the market value of the positions with the transaction's trade amount, such as Private Equity transaction types."},
{"pos": "88", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Average price with separate items – The \"with separate items\" option valuates your portfolios with average price, but keeps track of original purchase dates."},
{"pos": "89", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"FIFO (combined) – The combined option valuates the portfolio based directly on transactions in the subportfolios."},
{"pos": "90", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Portfolio name*. Name of the portfolio."},
{"pos": "91", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Type*. Choose the portfolio type from the alternatives, which are defined in Preferences - Portfolio types. The portfolio type can be for example Investment portfolio or Insurance portfolio."},
{"pos": "92", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Aggregation of subportfolios. Choose the method to aggregate positions from subportfolios in reporting and analytics:"},
{"pos": "93", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Sum up values – Aggregate the position amounts without currency conversion. Use it if the subportfolio currencies are the same as the main portfolio currency."},
{"pos": "94", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Recalculate values – Aggregate transactions from subportfolios and convert the amounts to the portfolio currency (using the FX rate valid on the transaction date). Use this option if you have sub portfolios in different currencies than the main portfolio currency."},
{"pos": "95", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Locked. Allows you to Lock your portfolio to prevent anyone from manually adding, modifying or deleting transactions or trade orders within the portfolio. If you try to change the transaction or trade orders within a locked portfolio, you will be notified that Your portfolio is locked! Locking a portfolio allows you to freeze your portfolio's contents from manual modifications, or for example collateralize assets by moving them to a locked sub-portfolio to prevent making modifications to the collateral."},
{"pos": "96", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Even when your portfolio is locked, you can still execute trade orders that have already been marked as executable, run corporate actions, and import transactions and trade orders to your portfolio."},
{"pos": "97", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Custody. Choose the custody of the portfolio from the alternatives, which are defined by creating a new contact of the type Custody."},
{"pos": "98", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Book entry. Define the book entry number for the portfolio."},
{"pos": "99", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Currency*. Choose the default currency for the portfolios from the alternatives, which are defined by creating a new security of the type currency. The default currency of a portfolio defines the currency used when creating reports for the portfolio, and the transactions are recorded in the portfolio default currency."},
{"pos": "100", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Source. Define the method for determining the Close market price for the securities in this portfolio. The chosen method Default, Manual, Close 1, 2, 3, 4 or 5 describes, which prices saved for a security are taken into account when determining the close price for the securities in this portfolio. The market price source is defined on a security level, but if the source of a security is Default, the source can be overridden on a portfolio level (e.g. for certain portfolios, the Close 2 prices of securities can be used even though the securities are set to use the default close prices)."},
{"pos": "101", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Language. Choose the language to be used in portfolio reports from the alternatives, which are defined in Preferences - Language. The default language of a portfolio is the language of its primary contact. The language chosen for a portfolio determines, which language is used in the portfolio reports when creating a report: the reports are created in the language of the portfolio. The translations for the security and transaction types to different languages are defined in Preferences - Internationalization. If no language is selected, the reports are printed out in Finnish and the abbreviations defined for security and transaction types are used."},
{"pos": "102", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Juridical form*. Choose the juridical form from the alternatives, which are defined in Preferences - Juridical form. The default juridical form of a portfolio is the juridical form of its primary contact. The juridical form affects the taxation of certain transactions added to the portfolios: when creating corporate actions, the tax associated with these is defined as a combination of juridical forms and tax countries of the portfolio."},
{"pos": "103", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Tax country*. Choose the tax country from the alternatives, which are defined in Preferences - Countries. The default tax country of a portfolio is the tax country of its primary contact."},
{"pos": "104", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Creation date. Define the creation date of the portfolio."},
{"pos": "105", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Start-up date. Define the start-up date of the portfolio."},
{"pos": "106", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Update date. Define the update date of the portfolio."},
{"pos": "107", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Model portfolio. Choose a model portfolio for the portfolio, which is used in the portfolio rebalancing (an optional extra to FA Portfolio). When a model portfolio is linked to the portfolio, the portfolio can be rebalanced to match the model portfolio, and the system automatically creates trade orders to buy and sell securities."},
{"pos": "108", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Posting rule. Choose the posting rules used for the portfolio from the alternatives that are defined in Preferences > Bookkeeping > Posting rule. For more information, see Posting-based bookkeeping."},
{"pos": "109", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Posting date. Define a posting date."},
{"pos": "110", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Close type. Choose the close for the portfolio: No change, Depreciation, Depreciation and refund or Market value. The close type relates to Closing a portfolio: a close type can be set to a portfolio already in the portfolio information, and used for example to check the portfolio's closing values with the Book values (closing) report."},
{"pos": "111", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Accrued interest. Choose whether the accrued interest is calculated on the position level based on Transaction date (default) or based on Settlement date."},
{"pos": "112", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Transaction date – the accrued interest on a position is calculated until the selected report date. If the bond is bought, the paid accrued interest of the purchase is used as the accrued interest of the position until the settlement date of the purchase."},
{"pos": "113", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Settlement date – the accrued interest on a position is calculate until the settlement date. The settlement date is defined versus the selected report date using the bond's settlement date offset (if enabled), holiday calendar and business day convention. If the settlement date offset is not enabled on the bond security, the default value 0 is used."},
{"pos": "114", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Tags. Choose tags from the alternatives defined in Preferences - General - Tags. Tags can be defined in three different ways:"},
{"pos": "115", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Grouped tags (select one): you can select one tag from each tag group, grouped in separate dropdowns. Only one tag in each tag group can be chosen. To group tags in a dropdown, defined them with a hyphen as \"group - tag\"."},
{"pos": "116", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Grouped tags (select multiple): you can select multiple tags from each tag group, grouped as separate sets of checkboxes. You can check multiple tags within each tag group. To group tags as a set of checkboxes, defined them with a colon as \"group : tag\"."},
{"pos": "117", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#basic-info-74593", "body":"Individual tags: search for individual tags by typing the tag in the field and choosing the correct tag from the list below the field - all available tags are shown from the downward arrow on the keyboard. You can select multiple individual tags."},
{"pos": "118", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Portfolio groups tab allows you to manage the static portfolio groups the portfolio belongs to and see which dynamic groups your portfolio is currently part of."},
{"pos": "119", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Available groups - list of portfolio groups the portfolio can be added to. The groups are listed with the group's name."},
{"pos": "120", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Current groups - list of portfolio groups the portfolio currently belongs to. The groups are listed with the group's name."},
{"pos": "121", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"Dynamic groups - list of dynamic groups the portfolio currently belongs to. The groups are listed with the group's name."},
{"pos": "122", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"You can add new portfolio groups to the portfolio by selecting them from \"Available groups\" and clicking the >> button, when the group is transferred to \"Current groups\". Similarly, you can remove a portfolio group from the portfolio by selecting it from \"Current groups\" and clicking the << button, and the portfolio group is transferred back to \"Available groups\". You can also add portfolios to a portfolio group through the Groups view [link]."},
{"pos": "123", "title":"Portfolio groups", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-groups", "body":"For dynamic groups, you can only see which dynamic groups your portfolio belongs to, but you cannot add or remove them. You can modify the dynamic group criteria through the Groups view, which then affects which portfolios are dynamically part of the group."},
{"pos": "124", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"IDs tab allows you to define external IDs for the portfolio. These IDs are used by other parties to identify the portfolio, and can be used for example in importing transactions to the portfolio or reconciling the portfolio against an external source."},
{"pos": "125", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"Add a new ID with the Add ID button, and define the ID information in the fields. A red star indicates a mandatory field:"},
{"pos": "126", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"External name*. The name of the ID (or who uses the ID, where is it from). When starting to type in an ID, the system automatically suggests ID names you have used previously."},
{"pos": "127", "title":"IDs", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#ids", "body":"External ID*. The external ID for the portfolio."},
{"pos": "128", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Memo allows you to write optional information, notes or observations related to the portfolio. The contents of the memo are also shown in the Memo section on the Overview, when the portfolio is selected."},
{"pos": "129", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"The Memo is divided into different parts, which can be used to write different kinds of notes and information:"},
{"pos": "130", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Memo. Notes written in memo can be seen on the Overview, when the portfolio is selected."},
{"pos": "131", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Explanation, Info 2 and Info 3 . Additional text fields that can be seen on the Overview, when the portfolio is selected."},
{"pos": "132", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"Description . The contents of the description field can only be seen in the Portfolio window, not on the Overview."},
{"pos": "133", "title":"Memo", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#memo", "body":"You can also import texts to the memo from a file through Import - Import portfolio memo, or to edit the contents of the memo directly from the Memo section on the Overview."},
{"pos": "134", "title":"Contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#contacts", "body":"Contacts tab allows you to choose the contact(s) of the portfolio as well as subportfolio(s) to the selected portfolio. The contact tab allows you to define your contact \/ portfolio structure visible on the Overview: in addition to having a contact with portfolios, you can also modify the structure by adding secondary contacts to a portfolio as well as dividing a portfolio into subportfolios."},
{"pos": "135", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"Selecting a contact for the portfolio is an important part when creating a portfolio: the contact of the portfolio identifies the owner of the portfolio. The Contacts tab allows you to define:"},
{"pos": "136", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"Primary contact - the primary \/ main owner of the portfolio (marked with a star on the contact listing). The primary contact is the main or \"legal\" owner of the portfolio, and various information is often picked from the portfolio's primary contact. The portfolio is also always shown under the primary contact on the Overview."},
{"pos": "137", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"Other contacts - in addition to the primary contact, you can also link other contacts to your portfolio. For example, for insurance portfolios, the primary contact is often the insurance company, while the private person taking the insurance can be linked as an other contact."},
{"pos": "138", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"The portfolio's contacts are listed on the left side of the window, and the portfolio's primary contact is marked with a star. You can add a new contact with the Add contact button, and you can view and modify the information of an existing contact by selecting the contact from the list. You can de-link the selected contact from the portfolio with the Delete button below the contact information."},
{"pos": "139", "title":"Selecting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-contacts", "body":"When creating a new portfolio, the first contact you add to the portfolio is marked added as the primary contact of the portfolio, and the primary contact is by default set to be the contact you had selected on the Overview. You can change the primary contact of a portfolio by de-linking the current primary contact from the portfolio, when the first contact on the list will be marked as the primary contact."},
{"pos": "140", "title":"Selecting subportfolios", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-subportfolios", "body":"Subportfolios allow you to add subportfolio(s) to the portfolio you are editing - the portfolio you are editing becomes the \"main\" portfolio, and the subportfolios you add will be shown below it in you portfolio hierarchy."},
{"pos": "141", "title":"Selecting subportfolios", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#selecting-subportfolios", "body":"The portfolio's subportfolios are listed on the left side of the window. You can add a new subportfolio with the Add subportfolio button, and you can view and modify the information of an existing subportfolio by selecting the subportfolio from the list. You can de-link the selected subportfolio with the Delete button below the subportfolio information."},
{"pos": "142", "title":"Asset managers", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#asset-managers", "body":"The Asset managers tab allows you to add asset managers to the portfolio. You can only choose existing contacts as asset managers of a portfolio. Whereas Contacts determines who owns the portfolio, Asset managers determine who manages and is responsible for the portfolio. Asset managers can, for example, be used in restricting access to portfolios through limited visibility."},
{"pos": "143", "title":"Asset managers", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#asset-managers", "body":"The portfolio's asset managers are listed on the left side of the window - choose the asset manager from the list to view or delete it. Add a new asset manager to the portfolio with the Add asset manager button below the asset manager listing. Choose the asset manager from the drop-down menu on the right side of the window, and add the chosen asset manager to the portfolio from the Add asset manager button below the asset manager information."},
{"pos": "144", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"The Accounts tab allows you to add different kinds of accounts to your portfolio. Accounts allow you to follow your portfolio's cash balance, and when linking transactions to an account, the system automatically keeps track of your account balance. Accounts are not mandatory to add when creating a portfolio, however if you want to be able to follow the cash balance of your portfolio, you need to add at least one cash account to your portfolio."},
{"pos": "145", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"The account on the top of the list considered as the default account of the portfolio, and all the transactions are by default created against this account. If you want to create transactions against another account than the default account, you often need to specifically select it. You can modify the order of the accounts by dragging an account to the desired place in the account listing. The order of the accounts affects the order the accounts are shown on the Overview and different reports."},
{"pos": "146", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"A portfolio can have one or more accounts: the existing accounts are listed on the left side of the window. Add a new account with the Add account button, and define the account information in the available fields. A red star indicates a mandatory field."},
{"pos": "147", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"The fields available are:"},
{"pos": "148", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Account no.*. The account number, for example the bank account number."},
{"pos": "149", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Currency*. The account currency from the alternatives, which are defined as securities of the type Currency."},
{"pos": "150", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Name*. The name for the account."},
{"pos": "151", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"BIC-code. The BIC code of the account."},
{"pos": "152", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Issuer. The issuer for your account from the Issuer type contacts defined in the system. Linking an issuer to your account allows you to keep track of who has issued the account. This is especially useful when analyzing your portfolio’s investments by issuer, when accounts and other investments are grouped similarly."},
{"pos": "153", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Secondary account no. A secondary account number to the account."},
{"pos": "154", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Category. The account category. When starting to type in a category, the system automatically suggests categories you have used previously."},
{"pos": "155", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Mandate reference. The mandate reference of the account."},
{"pos": "156", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Calendar (day count convention). The day count convention for the account. The day count is used to convert dates to a numeric representation for financial maths, and can be used in calculating accrued interest on the account with a custom formula"},
{"pos": "157", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Fixing. The annual fixing as a percentage %. Fixing can be used in calculating accrued interest on the account with a custom formula."},
{"pos": "158", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Base instrument. The base instrument from the securities defined in the system. Base instrument can be used in calculating accrued interest on the account with a custom formula."},
{"pos": "159", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Spread. The spread added to the values from the base instrument as a percentage %. Spread can be used in calculating accrued interest on the account with a custom formula."},
{"pos": "160", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Decimals for transactions. The number of decimal places used in transactions created against the account. \"Default\" value means:"},
{"pos": "161", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"For cash transactions – The number of decimal places specified in the Block size field for the currency security (for details, see Security window). If the Block size field isn't defined, \"default\" means the number of decimal places defined in the security type settings (for details, see Security types)."},
{"pos": "162", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"For other transactions – The number of decimal places specified in Preference → Content and translations → Date and decimal formats."},
{"pos": "163", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Cash account (part of portfolio's cash). Indicates if the account is considered as a Cash account or as Other account (available from FA 2.3 onward). By default, accounts are marked as cash accounts, but you can disable this selection to make your account appear as an other account. This allows you to distinguish between actual cash accounts and other accounts that are used to track commitments, accrued fees, etc. Cash accounts and other accounts are also grouped separately within FA, for example on the Overview."},
{"pos": "164", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Hide if balance is zero. Hides the account on the Overview and Positions reports when the account balance is zero. The account is shown only when there is some balance, and prevent showing empty accounts with zero balance in the portfolio. By default, accounts are defined not to be hidden."},
{"pos": "165", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to primary contact's portfolios \/ Shared to all parent portfolios'subportfolios. Account sharing options:"},
{"pos": "166", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to all linked contact's portfolios indicates that the account is shared to all portfolios of all contacts that are linked to this porfolio."},
{"pos": "167", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to primary contact's portfolios indicates that the account is shared to all portfolios where the same customer is the primary contact. This option lets you chose the account for transactions in other portfolios of the same customer."},
{"pos": "168", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to all parent portfolios' subportfolios indicates that the account is shared only to parent portfolio's subportfolios."},
{"pos": "169", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"By default, these sharing options are off. Accounts are shared only to subportfolios of the current portfolio."},
{"pos": "170", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"You can use shared accounts when you create transactions manually or by importing. Also, shared accounts are used by the system when it creates transactions through corporate actions or trade order execution and when it creates trade orders through rebalancing. FA first checks if the portfolio has its own accounts that can be used, and if not, then checks if the portfolio has shared accounts that can be used."},
{"pos": "171", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Visibility (include account in reports). Indicates if the account is visible on the Overview and other views, taken into account on all portfolio reports, and available as a criterion when defining dynamic groups. The visibility is chosen as a default for all accounts. If an account is defined as hidden (i.e. not visible), then the account is ignored in all calculations."},
{"pos": "172", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Exclude balance from portfolio's total. Check if you want the account to be shown in your positions, while its balance is not included in the total market value (or other total values) of your portfolio. By default, accounts are not excluded from portfolio's total. This option is useful for example in tracking total capital added to an insurance contract and profits taken out - account is shown within your position, but the account balance is not added up to your portfolio's total value."},
{"pos": "173", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Shared to all linked contacts' portfolios. Indicates if the account is shared among all the portfolios where the same contact is linked as a contact. The functionality is otherwise the same as in \"Shared to primary contact's portfolios\" - the first option considers only primary contacts, while the latter option considers all linked contacts when determining which portfolios the account is shared to."},
{"pos": "174", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Account tags . Account tags from the alternatives defined in Preferences - General - Tags. Tags can be defined in the following ways:"},
{"pos": "175", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Grouped tags (select one): you can select one tag from each tag group, grouped in separate drop-downs. Only one tag in each tag group can be chosen. To group tags in a drop-down, defined them with a hyphen as \"group - tag\"."},
{"pos": "176", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Grouped tags (select multiple): you can select multiple tags from each tag group, grouped as separate sets of checkboxes. You can check multiple tags within each tag group. To group tags as a set of check boxes, defined them with a colon as \"group : tag\"."},
{"pos": "177", "title":"Accounts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#accounts", "body":"Individual tags: search for individual tags by typing the tag in the field and choosing the correct tag from the list below the field - all available tags are show from the downward arrow on the keyboard. You can select multiple individual tags."},
{"pos": "178", "title":"Reporting", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting", "body":"Reporting tab allows you to define the information related to whom this portfolio should be reported to, and information needed to sending reports via email."},
{"pos": "179", "title":"Reporting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-contacts", "body":"You can set one or more contacts as \"reporting contacts\", or contacts to whom this portfolio should be reported to. All the reporting contacts are listed on the left side of the window based on the name of the contact. The primary contact of the portfolio is marked with a star, and the primary contact is a default reporting contact."},
{"pos": "180", "title":"Reporting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-contacts", "body":"Choose a contact from the list to view or delete it. Add a new reporting contact to the portfolio with the Add reporting button below the contact listing. Choose the contact from the drop-down menu on the right side of the window, and add the chosen contact to the portfolio from the Add reporting button below the asset manager information."},
{"pos": "181", "title":"Reporting contacts", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-contacts", "body":"The reporting contact is \"nice-to-know\" information, and it is not directly used by the system in reporting. For example, when sending reports via email per customer, the customers the email is sent to is picked up from portfolio contacts, not reporting contacts."},
{"pos": "182", "title":"Reporting email addresses", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-email-addresses", "body":"When sending reports via email per portfolio, the generated reports are sent to the email addresses listed within the Reporting tab. If not email address is defined, no reports are sent to this portfolio via email."},
{"pos": "183", "title":"Reporting email addresses", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-email-addresses", "body":"The available fields are:"},
{"pos": "184", "title":"Reporting email addresses", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#reporting-email-addresses", "body":"Email addresses. The email addresses to send out this portfolio's reports when sending reports via email per portfolio. This field is useful if you want to define per portfolio who should receive this portfolio's reports, especially if you want to send to reports to a contact not found in the system. You can define several email addresses in this field, just separate the addresses with a comma."},
{"pos": "185", "title":"Fees", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#fees", "body":"Fees tab allows you to define the different default fees related to the transactions created to the portfolio."},
{"pos": "186", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Cost types allow you to associate different fees to your portfolio - a fee always consists a type (i.e. what kind of a fee this is), and a fee value (i.e. 1%). The fees you associate with your portfolio are often used as parameters in your fee formulas, in other customizations you have in your system, or as \"nice-to-know\" information on your portfolio's fees."},
{"pos": "187", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"In addition, specific fee types are used when calculating fees to trade orders in Rebalancing, when calculating costs for trade orders in Trade order execution, and when manually entering transactions in the Transaction window. You can use the fees of the type \"transaction\" by typing a question mark (?) to the Fee field in the Transaction window - the system automatically calculates the fee for the transactions by using the defined \"transaction\" fee percentage from the portfolio."},
{"pos": "188", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"The fees added to your portfolio are listed on the left side of the window: you can associate any fee type defied in Preferences - Fee calculation - Portfolio cost types and a portfolio-specific fee percentage to your portfolio. Choose a fee from the listing to view or delete it, and add a new fee to your portfolio with the Add button below the listing. Fill in the account information in the available fields."},
{"pos": "189", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"The available fields are:"},
{"pos": "190", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Cost type - choose the cost type of the fee from the alternatives, which are defined in portfolio cost type preferences (to learn more, see Preferences - Fee calculation). The type determines what kind of a fee you are adding, and different types of fees might be considered differently within you system."},
{"pos": "191", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Name - shows the name of the chosen cost type."},
{"pos": "192", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Type - shows the type of the chosen cost type."},
{"pos": "193", "title":"Cost types", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-types", "body":"Value - define the value of the fee - usually, the fees are defined as percentages (i.e. 1,00 means 1%)."},
{"pos": "194", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Cost formulas you link to your portfolio are used in Fee calculation, for example when calculating the Asset management fee for the portfolio."},
{"pos": "195", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"The cost formulas linked to your portfolio are listed on the left side of the window: you can link any cost formula defined in Cost formula Preferences to your portfolio (to learn more, see Preferences - Fee calculation). Choose a fee from the listing to view or delete it, and add a new fee to your portfolio with the Add button below the listing. Fill in the account information in the available fields."},
{"pos": "196", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"The fields available are:"},
{"pos": "197", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Cost formula – choose the cost type of the fee from the alternatives, which are defined in cost formula preferences (to learn more, see Preferences - Fee calculation). The formula determines how \/ with what logic the fee is calculated to the portfolio. The eye icon next to the field allows you to preview the the logic \/ code of the formula."},
{"pos": "198", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Name – shows the name of the chosen cost formula."},
{"pos": "199", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Code – shows the code of the chosen cost formula."},
{"pos": "200", "title":"Cost formulas", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#cost-formulas", "body":"Transaction type - shows the transaction type associated with the selected cost formula: which transaction type the formula is associated with."},
{"pos": "201", "title":"Benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#benchmark", "body":"Benchmark tab allows you to define a benchmark index to your a portfolio in two ways: you can either define a portfolio-specific benchmark index, or link a general benchmark index to your portfolio (for details, see Preferences - Portfolios)."},
{"pos": "202", "title":"Benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#benchmark", "body":"Benchmark indices are used to compare the performance or return of a portfolio to an index. You can define benchmarks that consist of a single index, or composite benchmarks that consist of a combination of different indices (e.g. a portfolio's performance can be compared to an index which is a composite of 40 % index A and 60 % index B). In addition, if your benchmark consists of indices in other currency than your portfolio's currency, the index values are converted to your portfolio's currency with a relevant FX rate. The benchmark index linked to a portfolio is visible for example on some P\/L reports and in Analytics."},
{"pos": "203", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"A portfolio-specific benchmark is used only for this one portfolio - any changes you make to the content of the benchmark affect only this one portfolio."},
{"pos": "204", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"When defining a benchmark, first select the date from which the benchmark is valid from for the portfolio and Add it to your benchmark definition. The start date should usually be set as the start date of your portfolio (i.e. when the portfolio starts getting in transactions) - if the benchmark starts later than your portfolio, then the benchmark will be shown as a flat line until the date it is valid from. If you want to update your benchmark's content, add a new date to it - the new content will be valid from the new date onward, while the prior index content will be used until the new date."},
{"pos": "205", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"Below each date you can see the content of the benchmark index. You can Add a new position for the index under the selected date: you need to define the security the index follows and the share of this security from the whole index. For each new position under the selected date, choose the index security from the drop-down menu. In the field next to the security, define the share of the selected security of the whole index. If the index follows a single security, define the share as 100 % - if the share of the selected security is less than 100, you have to create new positions and define their shares so that the sum of the shares of different securities under one date equals 100."},
{"pos": "206", "title":"Portfolio-specific benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#portfolio-specific-benchmark", "body":"In addition, you can Copy model portfolio benchmark. If a Model portfolio is linked to the portfolio in the Basic info tab, and if a benchmark index is defined to the portfolio linked to the model portfolio in Model portfolio window, the benchmark index can be fetched from the model portfolio's linked portfolio and added to your portfolio. The option is only available, if a model portfolio is linked to the portfolio, and a benchmark index can be found from the model portfolio."},
{"pos": "207", "title":"General benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#general-benchmark", "body":"You can also set a general benchmark index to your portfolio instead of defining a portfolio-specific benchmark index. You can choose a general benchmark from the options you have defined in Benchmark index Preferences (see Preferences - Portfolios). The benchmark index information of the selected index is shown at the bottom of the window."},
{"pos": "208", "title":"Current benchmark", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#current-benchmark", "body":"The Current benchmark tab shows the benchmark values on the specified date."},
{"pos": "209", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"Strategy tab allows you to define a strategy for your portfolio, similar to defining an allocation to a security. Strategies can be used to follow your portfolio's allocation against your portfolio's strategy and see whether your portfolio's contents are following your strategy. Make sure you have also allocated your securities with same asset classes and types for comparison to work!"},
{"pos": "210", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"A strategy consists of asset types (defined in Asset classes and types Preferences) with percentage shares of how many percentages each asset type constitutes of the entire strategy. In addition to defining fixed shares, you can also define the minimum and maximum shares for each asset type."},
{"pos": "211", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"Your portfolio can contain multiple strategies, allowing you to easily define and maintain different strategies for example for asset allocation, geographical allocation and industrial allocation. You can manage your portfolio's strategy the same way you manage your security's allocations, with the addition of being able to define a Min share % and Max share % for each asset type. Each strategy consists of asset types from one allocation group, allowing you to maintain separate strategies from different points-of-views. (Available from FA 3.7 onward)"},
{"pos": "212", "title":"Strategy", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#strategy", "body":"Prior to FA 3.7, your portfolio contained one strategy, which was defined combining asset types from different allocation groups. For example, your strategy could have been 90% Europe (Geographical allocation), 10% Other (Geographical allocation) and 100% Equity (Asset allocation) - after FA 3.7, this is instead interpreted as two strategies, one for Geographical allocation and one for Asset allocation."},
{"pos": "213", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"Investment plan allows you to define an investment plan for the portfolio - the user interface works similarly to defining a benchmark index or a strategy to a portfolio. You can use your portfolio's investment plan as a portfolio-specific model when rebalancing your portfolios."},
{"pos": "214", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"An investment plan consists of securities with percentage shares of how many percent each security constitutes of the entire plan. Investment plan essentially allows you to define which individual instruments you want to invest in, and how big of a share out of your portfolio total you want to target to invest in a specific security. If you want to include portfolio's account as a position in your investment plan, add the currency of the account as a security in the plan. See also Including portfolio's cash in model portfolios."},
{"pos": "215", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"In addition to defining target shares for each position, you can also define the minimum and maximum shares for each security. This allows you to define minimum and maximum “thresholds” for each position, or how much you'd allow your position to deviate or drift from your target. For example, you can add an instrument to your plan with target 10%, min threshold 9% and max threshold 11%. (Available from FA 3.8 onward)"},
{"pos": "216", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"Minimum and maximum thresholds are validated, ensuring they align with your target - if you have defined either Min share % or Max share % , your Min share % should be smaller or equal to target Share %, and Max share % should be larger or equal to target Share %. Thus, should always define both minimum and maximum threshold (if you only define a Max share %, leaving the Min share % untouched interprets 0% minimum threshold). If you try to save invalid min and max thresholds, you are presented with a warning Min and max shares should be consistent with the target share % and prevented to save invalid thresholds. You can also choose not define minimum and maximum shares in your investment plan - if you leave both min and max untouched (i.e. both min and max share are 0), they are shown with a hyphen \"-\" in your plan."},
{"pos": "217", "title":"Investment plan", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#investment-plan", "body":"Investment plan does not have to add up to 100%, allowing you to define partial or leveraged investment plans. However, if your investment plan doesn't add up to 100%, you are presented with a question \"Positions in your investment plan add up to xx %. Do you want to save your investment plan even though it does not add up to 100 %?\" to prevent you from unintentionally saving non-complete investment plans."},
{"pos": "218", "title":"Limits", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#limits", "body":"The Limits tab allows you to link, analyze and monitor limits, or investment constraints on your portfolio."},
{"pos": "219", "title":"Limits", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#limits", "body":"For more information, see Limits and limit monitoring."},
{"pos": "220", "title":"Key figures", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#key-figures-2", "body":"The Key figures tab allows you to store a time series of values of your choice - you can for example store fee percentages that change over time. For more details, see Key figures for contacts, portfolios and securities."},
{"pos": "221", "title":"Documents", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#documents-2", "body":"The Documents tab allows you to manage documents related to your portfolios. For more information, see Document management."},
{"pos": "222", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Saving a portfolio saves the portfolio into the system, and after you save the portfolio, you can for example create transactions to it. When editing the information of an existing portfolio, usually the system just updates the portfolio information - the updated information is picked up by the system automatically."},
{"pos": "223", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"However, if you modify Valuation method or Source field value within the Basic info, modify your portfolio's accounts within the Accounts tab, or change your portfolio's benchmark within the Benchmark tab, the system automatically triggers a report recalculation to update the effect of the change into your portfolio's positions."},
{"pos": "224", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"At the bottom of the Portfolio window, you can:"},
{"pos": "225", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Save and close – saves the portfolio \/ the changes made to the portfolio information and closes the window."},
{"pos": "226", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Save – saves the changes made to the portfolio information, and takes you back to the Basic info tab."},
{"pos": "227", "title":"Saving a portfolio", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#saving-a-portfolio", "body":"Copy as new – copies all of the existing portfolio's information as a base for you to create a new portfolio with a new ID. This function copies all other portfolio information except for the Portfolio ID, External ID and entries in the IDs tab, since these are portfolio-specific and related to only one single portfolio."},
{"pos": "228", "title":"Related links", "document":["FA Back reference"], " ":[], "url":"portfolio-window.html#related-links-2", "body":"Manage portfolios, positions, and accounts in FA User guide"},
{"pos": "229", "title":"Security window", "document":["FA Back reference"], " ":[], "url":"security-window.html", "body":"The security window allows you to create a new security or to view and edit the information of existing securities. You can create a new security through the menu from New - New security, and you can view the information of existing securities by double-clicking (or by right-clicking the security and choosing Open) a security either from your search result on the Securities view or from the position section on the Overview or Analytics+ view."},
{"pos": "230", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Basic info tab allows you to define basic properties of a security, such as name and code of the security. A red star indicates that a field is mandatory. Based on the selected security type (and its base type), the available fields vary slightly - some fields are only available on certain types of securities, and some types of securities have a more limited set of fields available."},
{"pos": "231", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"The fields available are:"},
{"pos": "232", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Code*. An individual code defined for the security. The security code separates the security from other securities (the system does not allow more than one security with the same security code). The code is used to identify the security and search for the security from the system. Best practice is not to include special characters into the security code - only use numbers and letters (a-z)."},
{"pos": "233", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"ISIN code. The ISIN code of the security: also the ISIN code together with the trade code can be used to update market prices to the security."},
{"pos": "234", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Name*. Name of the security."},
{"pos": "235", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Status*. Choose the status from the alternatives: Closed, Passive or Active. Only active securities are shown in the Basic view, and only active securities can be chosen in the Transaction window - all securities can be searched in the Securities view."},
{"pos": "236", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Type*. Choose the type of the security from the alternatives. The drop-down menu shows security types defined in Security type Preferences. When changing the type of the security from a base type to another (e.g. changing a bond to be a stock) also clears the information that is not supported by the new base type (in the example above, all bond-specific information would be cleared since not supported by the base type stock). You can see the list of security types used in Standard Solution in FA User guide: Standard security types ."},
{"pos": "237", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Sub type. Subtype of the security from the alternatives, which are defined in Security type Preferences. Only the subtypes defined for the selected security type are visible in the drop-down menu - subtypes define even further the selected security type."},
{"pos": "238", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Base currency. Only available for securities with the base type CURRENCY_CROSS. Base currency allows you to select the base currency of your currency cross, i.e. for a currency cross EUR\/USD, your base currency would be EUR - for this currency cross, set the quote currency USD to the Currency field."},
{"pos": "239", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Currency*. Choose the currency your security is quoted in, i.e. the quote currency. All securities of the basic type currency are listed in the drop-down menu. You can see the list of currencies that are available in Standard Solution in FA User guide: Currencies (ISO 4217) ."},
{"pos": "240", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Country. Choose security country from the alternatives, which are defined in Countries Preferences. The country of the security affects the taxation (corporate action) transactions: the country of the security related to a corporate action affects the taxation of the transaction."},
{"pos": "241", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Marketplace. Choose the marketplace of the security from the alternatives, which are defined in Marketplace Preferences. The marketplace indicates, where the security is traded."},
{"pos": "242", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Trade code. Define a trade code for the security, which can be used to for example automatically update market prices to the security."},
{"pos": "243", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Update code 1, 2 and 3. Update codes are used in updating market prices for a security: the different update codes allow market prices to be imported and saved from different sources. The update code of the primary market data source should be defined in the Update code 1 field and so forth. The update codes are used when importing market prices: the imported market prices are saved in the right column on the Market data info tab based on the update codes defined. If market prices are automatically fetched from an external market prices source, one of the update code fields is reserved for the update code used by the external source."},
{"pos": "244", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Settlement place. Choose the marketplace of the security from the alternatives, which are defined in Settlement place Preferences. The settlement palace indicates, where the security is settled."},
{"pos": "245", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"URL and URL 2. You can define for example links to security brochures."},
{"pos": "246", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Rating. Define the security's rating."},
{"pos": "247", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Tenor. Select a tenor for your interest rate security. Tenors are used when building yield curves in Yield curves Preferences to determine the duration \/ maturity of the interest rate."},
{"pos": "248", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Block size. Define the trade unit of the security. When equal to or less than one, the block size also affects the decimal places allowed for created cash transactions and trade orders. If no block size is defined, the allowed decimal places come from the security type preferences (see Security types). For example, if the block size is set to 0,01 the amount of the security in a transaction or trade order can be defined with two decimals, or if the block size is set to 1, the amount of the security in a transaction or trade order can be defined only with whole numbers."},
{"pos": "249", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"You can also define the decimal places to use in transactions created against a certain account. For details, see Accounts."},
{"pos": "250", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Multipliers allow you to handle situations where you want to manipulate the unit prices you enter in the system:"},
{"pos": "251", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Multiplier – A computational value for the security price: the prices are divided with the multiplier before they are used in any calculations. The multiplier is 1, if the security is quoted in a currency, or 100, if the security is quoted in percentages. For example, if the security price is declared as 198,50, but the actual price to calculate the value is 1,9859, the value of the multiplier is set to 100, when the system uses the price as 1,9850."},
{"pos": "252", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Multiplier 2 – A computational value for the security price: the prices used in calculations are multiplied with the multiplier 2 before they are shown to the user. The multiplier 2 is 1 if the price is shown as it is in the system after being divided with the first multiplier. See the example above: if the multiplier 2 is 1, the price is shown as 1,9850, and if the multiplier 2 is 100, the price is shown as 198,50."},
{"pos": "253", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"For bonds, you usually define the multipliers as 100 and 100 - the first multiplier divides the price you receive to use it in calculations (e.g. 198,50 \/ 100 = 1,9850), and the second multiplier multiplies the value back to show it correctly to the user (e.g. 1,9850 * 100 = 198,50). For some funds, you might want to define only the first multiplier as 1000, if you receive your prices as thousands but want to show them as you use them i.e. as ones, to you user (e.g. 1 653 \/ 1 000 = 1,653). If you define only the first multiplier, close prices you receive on your security are divided with it, but you can still enter prices manually (such as unit price of a transaction, manual price of a security, etc.) \"as ones\" instead of \"as thousands\", i.e. without the first multiplier effect."},
{"pos": "254", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Holiday calendar and Settlement date offset allow you to flexibly control on the security level which days are considered as holidays and how many days the security takes to settle. Holiday calendar and settlement date offset are used for accrued interest and coupon calculations for bonds and for calculating the settlement date for trades in the security, i.e. how many business days trades for the security take to settle, and which market’s holiday calendar is used to determine these business days. For example, you can configure specific securities to settle in t+2 in a certain market, while others might settle in t+3 in another market."},
{"pos": "255", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Holiday calendar – A holiday calendar that is used for this security to distinguish between business days and holidays in the market the security is traded in - the alternatives allow you to select any holiday calendar configured in Holiday calendar Preferences, such as a weekend calendar (for example Saturday\/Sunday weekends or Friday\/Saturday weekends) or a market-specific holiday calendar. You can set the default holiday calendar set for all new securities in the Default holiday calendar Preferences."},
{"pos": "256", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Enabled settl. date and Settl. date – The settlement date offset, or the security-specific number of days used when determining the settlement date for the security."},
{"pos": "257", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Total outstanding amount. The total amount of shares outstanding. This value is used to calculate a Holding % available as a column in position listings."},
{"pos": "258", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Issuer. The issuer of the security from the alternatives. Issuers are defined in the system as contacts with the type Issuer."},
{"pos": "259", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Issuer description. The security issuer description."},
{"pos": "260", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Linked portfolio. The portfolio the security is based on. The linked portfolio is chosen from alternatives containing all the portfolios saved in the system. For example, funds and structured products are often based on a portfolio containing multiple different securities."},
{"pos": "261", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Linked security. Another security linked to your security. For example, you can link the underlying stock to your equity option, or link the underlying instrument to a derivative."},
{"pos": "262", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Manipulation. The manipulation of security prices: Direct (default, the prices are used directly as they are shown), Invert (the prices are shown as inverted) or In its own currency (the prices are shown without a currency conversion). The manipulation describes how security purchase and market unit prices are shown - usually prices are shown as \"direct\" (i.e. as they are used). The other options allow you for example to show FX rates as \"invert\" (i.e. inverted in relation to how they are used in calculations) or foreign-currency bonds \"in their own currency\" (i.e. even though the market value of your position is calculated in portfolio currency, the unit prices are shown without a currency conversion, allowing you to see the bond unit price directly as \"percentage of the issue price\")."},
{"pos": "263", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Source*. The method for determining the Close market data price: Default, Manual, Close 1, Close 2, Close 3, Close 4 or Close 5. The chosen method describes, which prices are taken into account when determining the Close price for a certain date. The Default selection takes the close price from either the manual or close 1 through 5 fields in prioritized order, from left to right, while the other selections take into account only the chosen source in determining the close market price."},
{"pos": "264", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Price from security. The security this security gets the market data information from. If a security is chosen, the market data information shown for this security is fetched from the chosen security's market data information - changes to the market data are done through the linked security. The market data is fetched from the linked security without the manipulation effect, or always as \"Direct\"."},
{"pos": "265", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Class 1, 2, 3, 4 and 5. Classes for the security. The classes to choose from are defined in Class Preferences. The classification system of securities can be defined as needed, and the classification system may consist of three parts: one class can be chosen for the security from each three classes available."},
{"pos": "266", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Tags. Choose tags from the alternatives defined in Preferences - General - Tags. Tags can be defined in three different ways:"},
{"pos": "267", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Grouped tags (select one): you can select one tag from each tag group, grouped in separate dropdowns. Only one tag in each tag group can be chosen. To group tags in a dropdown, defined them with a hyphen as \"group - tag\"."},
{"pos": "268", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Grouped tags (select multiple): you can select multiple tags from each tag group, grouped as separate sets of checkboxes. You can check multiple tags within each tag group. To group tags as a set of checkboxes, defined them with a colon as \"group : tag\"."},
{"pos": "269", "title":"Basic info", "document":["FA Back reference"], " ":[], "url":"security-window.html#basic-info-74583", "body":"Individual tags: search for individual tags by typing the tag in the field and choosing the correct tag from the list below the field - all available tags are shown from the downward arrow on the keyboard. You can select multiple individual tags."},
{"pos": "270", "title":"Extra info", "document":["FA Back reference"], " ":[], "url":"security-window.html#extra-info-3-176995", "body":"When entering information for a security with certain base types, the Security window contains an additional tab for you to define extra information relevant for these types of securities. Extra info is available for base types BOND, FUTURE, DISCOUNT and OPTION, while Fixings, Index calc. method and Redemption are relevant and available for base type BOND. The information is used for example when calculating accrued interests for a bond or when creating a coupon payment corporate action for a bond."},
{"pos": "271", "title":"Extra info", "document":["FA Back reference"], " ":[], "url":"security-window.html#extra-info-3-176995-1", "body":"The top section of the Extra info tab allows you to define extra information for your bond, option, or future security, such as Issue date, Issue price, Maturity date, Maturity price and Call date."},
{"pos": "272", "title":"Fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixings", "body":"Fixings tab allows you to define the fixing information for your security, especially relevant for calculating accrued interests and coupon payments on bonds. You can define fixings either as fixed (for example fixed rate bonds), or as floating (for example floating rate notes)."},
{"pos": "273", "title":"Fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixings", "body":"Fixing information is used to calculate the accrued interest for securities of base type BOND. Accrued interest on the position level is calculated based on the selected report date (unless you have overridden this in the Portfolio window, Accrued interest field), holiday calendar and business day convention. If the bond is bought, the paid accrued interest of the purchase is used as the accrued interest of the position until the settlement date of the purchase. Bought accrued interest in the Transaction window is calculated based on the settlement date of the transaction."},
{"pos": "274", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"The fields at the top of the tab allow you to define relevant information for fixings."},
{"pos": "275", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Calendar . The day count convention for the bond (see Day count convention). The day count is used to convert dates to a numeric representation for financial maths, and is the base for accrued interest and coupon calculations for bond."},
{"pos": "276", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Frequency . The frequency (how often fixings are paid): Daily, Weekly, Every two weeks, Every four weeks, Every 13 weeks, Every 26 weeks, Every 52 weeks, Monthly, Every two months, Every three months, Every four months, Every six months, Annually or Once (zero-coupon bond)."},
{"pos": "277", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"For fixed rate bonds, define the fixed fixing information:"},
{"pos": "278", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"First fixing date. The first fixing date indicates the date of the first fixing after the security is issued. After the selected first fixing date, the following fixing dates are determined based on the calendar and frequency selected."},
{"pos": "279", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Coupon (\"Fixing\" before FA 3.7). The annual fixing as a percentage %."},
{"pos": "280", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"For bonds, define additional parameters for calculating accrued interests and coupons (follow the links for more detailed description of the alternatives):"},
{"pos": "281", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Stub convention . The rule used to place the stub period in the bond's schedule, if one should occur. When determining a schedule (i.e. how often a coupon is paid), each date between the start date and end date based on the day count convention is allocated into a period. Most dates are allocated into a regular period, based on the selected frequency. Any dates left over are allocated to a stub, either at the start or end."},
{"pos": "282", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Business day convention. The rule used to to adjust a date (such as coupon date of a bond) if it falls on a non-business day."},
{"pos": "283", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Roll convention. The rule used to override the default schedule of a bond if needed. For example, roll convention “end-of-month” allows you to configure that the first date of a monthly schedule, such as June 30th, should roll to the last day of each month instead of the 30th of each month (Available from FA 3.5 onward)."},
{"pos": "284", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Ex-coupon period. The number of days before the coupon payment date during which the bond is traded ex-coupon, or without coupon (if the bond is bought during the ex-coupon period, the next coupon is paid to the previous holder of the bond, not the buyer)."},
{"pos": "285", "title":"Fixed fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixed-fixings", "body":"Yield convention. The convention to use for calculating yield to maturity, durations and convexity from the alternatives UK BUMP\/DMO method, US street, German bonds (default) and Japan simple yield."},
{"pos": "286", "title":"Base instrument and spread", "document":["FA Back reference"], " ":[], "url":"security-window.html#base-instrument-and-spread", "body":"You can define information relevant for floating rate notes linked to another instrument:"},
{"pos": "287", "title":"Base instrument and spread", "document":["FA Back reference"], " ":[], "url":"security-window.html#base-instrument-and-spread", "body":"Base instrument . The base instrument from the securities defined in the system. The base instrument can be used as information for example for calculating fixings for floating rate notes."},
{"pos": "288", "title":"Base instrument and spread", "document":["FA Back reference"], " ":[], "url":"security-window.html#base-instrument-and-spread", "body":"Spread . The spread added to the values from the base instrument as a percentage %."},
{"pos": "289", "title":"Base instrument and spread", "document":["FA Back reference"], " ":[], "url":"security-window.html#base-instrument-and-spread", "body":"Offset days. The number of days before the observation a new reset rate is set."},
{"pos": "290", "title":"Base instrument and spread", "document":["FA Back reference"], " ":[], "url":"security-window.html#base-instrument-and-spread", "body":"If you want to generate fixings for your floating rate notes based on the base instrument and spread, use the \"Populate fixings for floating rate notes\" process (available from FA AppStore)."},
{"pos": "291", "title":"Fixings for a floating rate note", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixings-for-a-floating-rate-note", "body":"For floating rate bonds, you can define the individual fixings manually. The manually-defined fixings are listed at the bottom left corner of the window, ordered with the date defined, newest first. A new fixing is added from the Add fixing button, and the fixing information is defined in the fields at the right-hand side of the window. A red star indicates that a field is mandatory."},
{"pos": "292", "title":"Fixings for a floating rate note", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixings-for-a-floating-rate-note", "body":"Fixing date* . The date from which the defined fixing rate is valid from."},
{"pos": "293", "title":"Fixings for a floating rate note", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixings-for-a-floating-rate-note", "body":"Fixing*. The value of the fixing as a percentage."},
{"pos": "294", "title":"Fixings for a floating rate note", "document":["FA Back reference"], " ":[], "url":"security-window.html#fixings-for-a-floating-rate-note", "body":"Thus, a manually added fixing of 1.1.2014 and 5,00 % indicates that the fixing rate for the bond is 5,00 % starting from 1.1.2014. Once this coupon is paid, a new fixing date and rate should be added to start from the coupon payment. After the fixing information is filled in, save the fixing with the OK button. Notice that the manually added fixings always override the fixed fixing defined."},
{"pos": "295", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995", "body":"For floating rate bonds, you can define the individual fixings manually. The manually-defined fixings are listed at the bottom left corner of the window, ordered with the date defined, newest first. A new fixing is added from the Add fixing button, and the fixing information is defined in the fields at the right-hand side of the window. A red star indicates that a field is mandatory."},
{"pos": "296", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995", "body":"Fixing date* . The date from which the defined fixing rate is valid from."},
{"pos": "297", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995", "body":"Fixing*  The value of the fixing as a percentage %."},
{"pos": "298", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995", "body":"Thus, a manually added fixing of 1.1.2014 and 5,00 % indicates that the fixing rate for the bond is 5,00 % starting from 1.1.2014. Once this coupon is paid, a new fixing date and rate should be added to start from the coupon payment. After the fixing information is filled in, save the fixing with the OK button. Notice that the manually added fixings always override the fixed fixing defined."},
{"pos": "299", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995-1", "body":"The Generate fixings button below the table allows you to generate a list of expected coupon dates based on the fixing information you defined above (excluding base instrument and spread), and populates the table with these fixings. This allows you to easily check if the bond information you entered results in appropriate fixings. If you already have some entries in the table, those will not be replaced, but instead, only the dates that would come after the latest date on the list are added."},
{"pos": "300", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995-1", "body":"The Delete all fixings button below the table allows you to delete all fixings you have added or generated to your bond security."},
{"pos": "301", "title":"Generate and delete fixings", "document":["FA Back reference"], " ":[], "url":"security-window.html#generate-and-delete-fixings-3-176995-1", "body":"Note that fixings should be generated only for floating rate notes - for fixed rate bonds, the \"Generate fixings\" allows you to test if your bond configurations result in an appropriate schedule, but saving the fixings for other than floating rate notes is not recommended."},
{"pos": "302", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"For index linked bonds, the price, accrued interests and coupons are adjusted with an index coefficient to compensate for changes in inflation. For index linked bonds, you can define the required information under the Index calc. method tab."},
{"pos": "303", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"When valuating a position of a security that has a linked index, a coefficient (calculated from the market prices of the linked index and index base value with the defined index convention) is taken into account (multiplied) when calculating the accrued interests and market value of the position. The index coefficient is calculated as Coefficient (date) = Linked index (date) \/ Index base value based on the information defined within the Index calc. method tab."},
{"pos": "304", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Fields to define the linked index:"},
{"pos": "305", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Calculation impact. Indicates if the defined linked index and index base value affect the Market value and accrued interest or Accrued interest. The first selection utilizes the linked index and index base value to calculate both the market value and accrued interests of an index linked bond according to the selected index convention, while the second selection applies the linked index and index base value only to the calculation of accrued interest according to the selected index convention, assuming that the market unit prices for the index linked bond are already index corrected."},
{"pos": "306", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Linked index. The linked index from the securities defined in the system. The market prices from the selected linked index are used to calculate the coefficient used to value an index linked bond according to the selected index convention."},
{"pos": "307", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Index base value . The value used to calculate the coefficient used to value an index linked bond according to the selected index convention."},
{"pos": "308", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Fields to define the index convention:"},
{"pos": "309", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Index convention . A pre-defined index convention from the conventions used in different countries or regions. Selecting an appropriate convention from the alternatives pre-fills the following fields for calculation mode and lags according to the selected convention, and valuates your index linked bonds with the linked index and index base value according to the convention of the region. If you cannot find an appropriate pre-defined convention, choose Other, and define the calculation parameters yourself."},
{"pos": "310", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Calculation mode . The calculation mode determines how the coefficient used to value an index linked bond is calculated based on the defined linked index and index base value:"},
{"pos": "311", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"With Linear interpolation, the coefficient used in valuating index linked bonds is calculated with the interpolated value of the linked index for months defined in lag 1 and lag 2 prior to the settlement date of the bond. For example, Swedish idex linked bonds use an interpolated index value for 2 and 3 months prior to the bond's settlement date."},
{"pos": "312", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"With Direct calculation, the coefficient used in valuating index linked bonds is calculated with an index value taken for months back as defined in lag 1. For example, Finnish index linked bonds use 3-month lag with no interpolation."},
{"pos": "313", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Lag 1 in months. A numeric value between 0 and 12, representing the lag 1 in months. Used both for direct calculation as months back, and in linear interpolation as the end point for the interpolation."},
{"pos": "314", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Lag 2 in months . A numeric value between 0 and 12, representing the lag 2 in months. Used only in linear interpolation as the starting point for the interpolation."},
{"pos": "315", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Pre-defined index conventions and the pre-filled values:"},
{"pos": "316", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"Redemption tab allows you to define the redemption information for your security, relevant for example for partial expirations. This information is not directly used by the system, but allows you to store relevant information on redemptions."},
{"pos": "317", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"Fields to define the redemption information:"},
{"pos": "318", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"Redemption . Redemption payment period: Annually, Semi-annually, Quarterly, Monthly, Weekly or Daily."},
{"pos": "319", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"First redemption date . The date of the first redemption after the security is issued. After the selected first redemption date, the following redemptions can be determined based on the frequency selected."},
{"pos": "320", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"You can also define individual redemptions manually. The manually-defined redemptions are listed at the bottom left corner of the window, ordered with the date defined, newest first. A new redemption is added from the Add redemption button, and the redemption information is defined in the fields at the right-hand side of the window:"},
{"pos": "321", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"Fixing date*. The date of the redemption."},
{"pos": "322", "title":"Redemption", "document":["FA Back reference"], " ":[], "url":"security-window.html#redemption", "body":"Fixing* - define the value of the redemption as a percentage %."},
{"pos": "323", "title":"Bond-related calculations", "document":["FA Back reference"], " ":[], "url":"security-window.html#bond-related-calculations", "body":"Bond-related calculations"},
{"pos": "324", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Day count convention is used to convert dates to a numeric representation for financial maths, and is the base for accrued interest and coupon calculations for bond. For more information about day count conventions, see the Opengamma site."},
{"pos": "325", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Options for day count conventions are:"},
{"pos": "326", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"1\/1"},
{"pos": "327", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30\/360 ISDA"},
{"pos": "328", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30\/360 PSA"},
{"pos": "329", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30E+\/360"},
{"pos": "330", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30E\/360"},
{"pos": "331", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30E\/360 ISDA"},
{"pos": "332", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30U\/360"},
{"pos": "333", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"30U\/360 EOM"},
{"pos": "334", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/360"},
{"pos": "335", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/364"},
{"pos": "336", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/365 Actual"},
{"pos": "337", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/365.25"},
{"pos": "338", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/365F"},
{"pos": "339", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/365L"},
{"pos": "340", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/366 – the same as Act\/360, but uses 366 as the denominator instead of 360."},
{"pos": "341", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/366.375 – the same as Act\/360, but uses 366.375 as the denominator instead of 360."},
{"pos": "342", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/Act AFB"},
{"pos": "343", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/Act ICMA"},
{"pos": "344", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/Act ISDA"},
{"pos": "345", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"Act\/Act Year"},
{"pos": "346", "title":"Day count convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#day-count-convention", "body":"NL\/365"},
{"pos": "347", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Stub convention determines where to place a stub period in the bond's schedule, if one should occur. When determining a schedule (i.e. how often a coupon is paid), each date between the start date and end date based on the day count convention is allocated into a period. Most dates are allocated into a regular period, based on the selected frequency. Any dates left over are allocated to a stub, either at the start or end."},
{"pos": "348", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Business day convention determines how to adjust a date (such as coupon date of a bond) if it falls on a non-business day. The business day convention is a simple rule that specifies how to change the date from a holiday or weekend to a valid business day."},
{"pos": "349", "title":"Roll convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#roll-convention", "body":"Roll convention allows you to override the standard approach of building a schedule for the bond, and determines how to roll the coupon payment date within the schedule. By default, roll convention is not set nor needed - bond's schedule is built automatically based on other bond information."},
{"pos": "350", "title":"Roll convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#roll-convention", "body":"Most common roll conventions are \"EOM\" (end-of-month) and \"IMM\" (3rd Wednesday of each month). For example, roll convention “end-of-month” allows you to configure that the first date of a monthly schedule, such as June 30th, should roll to the last day of each month instead of the 30th of each month."},
{"pos": "351", "title":"Roll convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#roll-convention", "body":"The concept is best illustrated with an example:"},
{"pos": "352", "title":"Roll convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#roll-convention", "body":"We have a bond with a frequency Every three months and the first fixing date is on a last day of a month with 30 days, such as June 30th."},
{"pos": "353", "title":"Roll convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#roll-convention", "body":"With standard approach of generating the schedule, the coupon dates would fall on the 30th of each month (September 30th, December 30th, March 30th, etc.). For months with 31 days, the coupon date would not be the last day of the month."},
{"pos": "354", "title":"Roll convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#roll-convention", "body":"If we want the coupon date to be the last day of each quarter (instead of the 30th), we can select the roll convention End of Month (EOM). With this selection, the system will recognize that June 30th is the last day of the month, and the coupon dates would fall on the last day of each month (September 30th, December 31st, March 31st, etc.)."},
{"pos": "355", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"Ex-coupon period determines the number of days before the coupon payment date during which the bond is traded ex-coupon, or without coupon (if the bond is bought during the ex-coupon period, the next coupon is paid to the previous holder of the bond, not the buyer)."},
{"pos": "356", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"From Investopedia: \"The ex-coupon date can be defined as the date by which the trade must occur if the buyer is to receive the upcoming coupon.\""},
{"pos": "357", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"The ex-coupon date is determined using the ex-coupon period setting, so that the ex-coupon date is the date that is the specified amount of days before the settlement date. Effectively, whoever holds the bond when that day ends, still gets the coupon. If the trade settles after that date, up until the settlement date, the next coupon goes to the previous owner (the seller) of the bond, and the buyer must be compensated for the few days' worth of interest that accrues while they are holding the bond, as the coupon will be paid in full to the seller."},
{"pos": "358", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"As the ex-coupon date is the last date when the next coupon will still go to the buyer, the ex-coupon period values 0 and 1 mean effectively the same thing, since on the coupon date the coupon is paid to whomever is entitled to receive it."},
{"pos": "359", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"The concept is best illustrated with an example:"},
{"pos": "360", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"Let's say we have a bond whose next coupon date is 7 January. The ex-coupon period for the bond is 3 days, which means the ex-coupon date is 4 January, using a \"no holidays\" holiday calendar. This means that, in order for the buyer to be eligible to receive the upcoming coupon, the trade must settle on 4 January at the latest."},
{"pos": "361", "title":"Ex-coupon period", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-coupon-period", "body":"For clarity, the example above assumes all days are business days, which corresponds to using a \"no holidays\" holiday calendar. When calculating date offsets (ex-coupon period and settlement date offset), the effective holiday calendar is considered, skipping weekends and other non-business days."},
{"pos": "362", "title":"Description", "document":["FA Back reference"], " ":[], "url":"security-window.html#description", "body":"Description tab allows you to write an optional and more detailed description of the security."},
{"pos": "363", "title":"Allocation", "document":["FA Back reference"], " ":[], "url":"security-window.html#allocation-74584", "body":"Allocation tab allows you to define the allocation of the security. The allocations related to an asset group defined for the security are listed on the left-hand side of the window: a security can have an allocation for each asset group defined in Asset classes and types Preferences. You can find the list of allocations available in Standard Solution in FA User guide: Asset classes and asset types."},
{"pos": "364", "title":"Allocation", "document":["FA Back reference"], " ":[], "url":"security-window.html#allocation-74584", "body":"For example, you can define geographical and industry-based allocations separately."},
{"pos": "365", "title":"Allocation", "document":["FA Back reference"], " ":[], "url":"security-window.html#allocation-74584", "body":"You can view and modify the allocation information by choosing the corresponding allocation group from the listing on the left. You can add a new allocation, and define the allocation information on the right-hand side of the window."},
{"pos": "366", "title":"Allocation", "document":["FA Back reference"], " ":[], "url":"security-window.html#allocation-74584", "body":"When defining an allocation, first choose the asset group you want to use (e.g. are you defining geographical or industry-based allocation). Second, select the date from which the allocation is valid from for the security and add it to your allocation definition. The start date should usually be set before this security appears in your portfolios (i.e. when your portfolios start getting in transactions for this security) - if the allocation starts later than the first transactions for this security come in, this security is allocated as Other until the date it is valid from. If you want to update your allocation's content, add a new date to it - the new content will be valid from the new date onward, while the prior index content will be used until the new date."},
{"pos": "367", "title":"Allocation", "document":["FA Back reference"], " ":[], "url":"security-window.html#allocation-74584", "body":"Below each date you can see the content of the allocation. You can add a new asset type under the selected date: you need to define the asset type and the share of this asset type from the whole allocation. For each new position under the selected date, choose the asset type from the drop-down menu. In the field next to it, define the share of the selected asset type of the whole allocation. If the allocation consists of a single asset type, define the share as 100 % - if the share of the selected asset type is less than 100, you have to create new positions and define their shares so that the sum of the shares of different asset types under one date equals 100."},
{"pos": "368", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Market data info tab allows you to view and modify the market data information of a security."},
{"pos": "369", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Market data entries are listed based on the date, newest first. The Close column shows you the close price of the day, or the market price that is used for the security for that date - this Close price is by default used when calculating the market value of positions in this security. The Close price is determined by the values of the other columns, Manual, Close 1, Close 2, Close 3, Close 4 and Close 5 together with the value of the Source filed on the Basic info tab as follows:"},
{"pos": "370", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"If the value of the Source field is set to Default, the first non-empty value is selected for the Close price when going through the columns from left to right. In other words, the value of the Close column is determined by default by the Manual column, then by Close 1 and so forth. The market price inserted in the Manual column always overrides the prices in the other columns for one date."},
{"pos": "371", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"If the value of the Source field is set to one of the columns, only the values in that column are taken into account when determining Close price. For example, if the value of the Source field is set to Close 1, the value of the Close column will be determined only by the Close 1 column: if there is a market price entry in the Manual column for a certain date but no Close 1 entry, no market price is chosen to the Close field for that date."},
{"pos": "372", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"In addition, you can select a Source value for a portfolio, when the portfolio uses the market values of the securities within it based on the above logic and the Source defined for the portfolio."},
{"pos": "373", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"You can modify an individual market data entry by choosing it from the listing. You can add a market data entry for the security with the Add market data button: define the new market price entry in the available fields."},
{"pos": "374", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Date*"},
{"pos": "375", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Choose the date of the market data entry."},
{"pos": "376", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Manual"},
{"pos": "377", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Manually define the market price for the date."},
{"pos": "378", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Close 1, 2, 3, 4 or 5"},
{"pos": "379", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Define the market price you received from your market data source into the corresponding close field. Recommendation is to use a Close field that corresponds with the Update code field you have defined in security's Basic info: the market data entry received from the price source defined in the Update code 1 field is entered in the Close 1 field and so forth. In order to be able to define the price, first enable the field(s) you are using with the checkbox above the field."},
{"pos": "380", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Accrual"},
{"pos": "381", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Define the value of accrual included in the market price. Accrual is tracked along with a market price, and the value in the accrual field indicates how much accrued income in security currency was included in that day’s market price - the accrual defined on the security is used to calculate your position's accrual as Amount*Accrual."},
{"pos": "382", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Accrual is recommended to be recorded along with a market price (i.e. a value in manual \/ one of the close fields), but you can track accrual also on its own. (Available from FA 3.7 onward) Your position's market value excludes your position's accrual, while your position's market unit price includes accrual, and market value (d) includes your position's accrual (available from FA 3.8 onward)."},
{"pos": "383", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Delta"},
{"pos": "384", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Define the value for delta. Delta defined on the security is used to calculate your position's exposure - if your security has delta, then the exposure is multiplied by delta. If delta is not found on the latest market data observation relative to the valuation date, delta is assumed to be 1. If security has price on the valuation date of 2020-01-30, but no delta is recorded on that date, delta is assumed to be 1. Even if delta is found on 2020-01-29, that delta is not used, since it was not found on the same date as the latest price. Thus, delta should always be recorded along with a market price, and value of delta is picked along with the market price used. (Available from FA 3.7 onward)"},
{"pos": "385", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"When the market data information is filled in, save the market data entry with the OK button below the fields. Versions button allows you to view the versions of each market data entry."},
{"pos": "386", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"You can also manage market data through the following buttons:"},
{"pos": "387", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"The Excel icon at the top-right"},
{"pos": "388", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Export the market prices."},
{"pos": "389", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Delete all market data"},
{"pos": "390", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Delete all market data from the security - this feature removes all market data entries you have saved to the security."},
{"pos": "391", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Delete prices"},
{"pos": "392", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Clear only the entires in a specific column, leaving other entires untouched."},
{"pos": "393", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Update close"},
{"pos": "394", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Fetch the latest market prices if they are missing, i.e. prices since the latest existing entry within the close field the system can find. If you want to fetch the entire history from the market data connector, first delete prices from the corresponding column and then update close prices."},
{"pos": "395", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Revaluate close 5"},
{"pos": "396", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"Calculate missing discount factors on your future cashflow securities - this button is only available if you have a permission to revaluate securities and the security's base type is DISCOUNT. For more information, see the Automatic and manual valuation in the Valuation of forward cashflows section."},
{"pos": "397", "title":"Market data info", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info", "body":"For bonds with appropriate bond information in the Extra information tab, FA also supports calculating the bond price based on importing YTM instead of bond price to the system. For more information, see the File formats for importing securities and security prices section. Price can be imported with % (e.g. 3.45%), when the system calculates the price according to YTM automatically."},
{"pos": "398", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"For a fund security, market data info is filled in automatically when you accept NAV in the FA Fund management app."},
{"pos": "399", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Manual"},
{"pos": "400", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Unit price in the share class currency."},
{"pos": "401", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Close 1"},
{"pos": "402", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Unit price in the fund's base currency."},
{"pos": "403", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Close 2"},
{"pos": "404", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Share class NAV in the fund's base currency."},
{"pos": "405", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Close 3"},
{"pos": "406", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Not used."},
{"pos": "407", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Close 4"},
{"pos": "408", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Unit price in the fund's base currency before swing."},
{"pos": "409", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Close 5, Accrued"},
{"pos": "410", "title":"Market data info for a fund security", "document":["FA Back reference"], " ":[], "url":"security-window.html#market-data-info-for-a-fund-security", "body":"Unit accrued income distribution."},
{"pos": "411", "title":"Key figures", "document":["FA Back reference"], " ":[], "url":"security-window.html#key-figures-3", "body":"Key figures tab allows you to store a time series of values of your choice - you can for example store different ratings (CO2 rating, credit rating, etc.) or other values to your securities. For more information, see the Key figures for contacts, portfolios and securities section."},
{"pos": "412", "title":"Key figures", "document":["FA Back reference"], " ":[], "url":"security-window.html#key-figures-3", "body":"In addition to the configurable key figures, for bond and fund securities, the key figures tab allows you to manually set certain security-specific key figures to be used instead of values calculated by FA. For more information, see the Security key figures section."},
{"pos": "413", "title":"Cost info", "document":["FA Back reference"], " ":[], "url":"security-window.html#cost-info", "body":"Cost info"},
{"pos": "414", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Costs tab allows you to define fixed costs and fees related to your security. Percentage (%) sign after the cost indicates that the cost in question is defined as a percentage of the price of the security - other costs and fees are announced in terms of currency."},
{"pos": "415", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Payment fee"},
{"pos": "416", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Payment fee in the security currency."},
{"pos": "417", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Payment fee percentage (%)"},
{"pos": "418", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Payment fee as a percentage of the security price."},
{"pos": "419", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Payment fee min"},
{"pos": "420", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Minimum payment fee."},
{"pos": "421", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Payment fee max"},
{"pos": "422", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Maximum payment fee."},
{"pos": "423", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Management fee"},
{"pos": "424", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Management fee in the security currency."},
{"pos": "425", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Management fee percentage (%)"},
{"pos": "426", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Management fee as a percentage of the security price."},
{"pos": "427", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Management fee min"},
{"pos": "428", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Minimum management fee."},
{"pos": "429", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Management fee max"},
{"pos": "430", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Maximum management fee."},
{"pos": "431", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Start-up fee"},
{"pos": "432", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Start-up fee in the security currency."},
{"pos": "433", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Kickback percentage (%)"},
{"pos": "434", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Kickback as a percentage."},
{"pos": "435", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Minimum trade amount"},
{"pos": "436", "title":"Costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#costs", "body":"Minimum trade amount for the security, i.e. what is the minimum trade amount of a trade for this security. The minimum trade amount defined is taken into account in rebalancing: trade orders smaller than the defined minimum are filtered out and not created."},
{"pos": "437", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Ex-ante \/ Ex-post costs tab allows you to define ex-ante and ex-post cost percentages under your security, allowing you to record and categorize all security-related costs. Define a date from which your cost categorization is valid from, and define the security's costs as percentages according to your desired categorization. This cost categorization can be used in ex-ante and ex-post cost analysis and reporting."},
{"pos": "438", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Date*"},
{"pos": "439", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Define a date from which your cost percentages are valid from. You can update your security costs by adding a new date and defining new cost percentages - the new values will be considered starting from the date you define."},
{"pos": "440", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Ex-ante costs"},
{"pos": "441", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Define ex-ante cost percentages for your security. You can break down the security's ex-ante costs into One-off charges, On-going charges, Charges related to transactions, Charges related to ancillary services or Incidental charges, or you can use up to five additional Other cost categories to categorize your costs even more extensively."},
{"pos": "442", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Ex-post costs"},
{"pos": "443", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Define ex-post cost percentages for your security."},
{"pos": "444", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Latest cost percentages are available as columns on the security listing, allowing you to easily search for securities with certain costs."},
{"pos": "445", "title":"Ex-ante \/ Ex-post costs", "document":["FA Back reference"], " ":[], "url":"security-window.html#ex-ante---ex-post-costs", "body":"Full ex-post disclosure of costs, calculated based on the defined cost categories, is available then on Analytics+ or on a specific Ex-post costs report."},
{"pos": "446", "title":"Documents", "document":["FA Back reference"], " ":[], "url":"security-window.html#documents-3", "body":"Document tab allows you to manage documents related to your securities. For more information, see the Document management section."},
{"pos": "447", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Saving a security saves the security into the system, and after you save the security, you can for example create transactions or trade orders on it. When editing the information of an existing security, usually saving is enough - the updated information is picked up by the system automatically."},
{"pos": "448", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"However, there are certain scenarios when you need to click Save & close (update) in order for the system to recalculate all affected portfolio reports for your changes to take effect."},
{"pos": "449", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"At the bottom of the Security window, you can:"},
{"pos": "450", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Save and close"},
{"pos": "451", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Saves the security \/ the changes made to the security information and closes the window."},
{"pos": "452", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Save"},
{"pos": "453", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Saves the changes made to the security information, and takes you back to the Basic info tab."},
{"pos": "454", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Save and close (update)"},
{"pos": "455", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Saves the security, closes the window and recalculates all affected portfolios' report data. This might affect multiple portfolios and the update might be triggered for a long period of time, depending on how many portfolios contain the security! Update is only necessary if you modify the below information, otherwise saving without an update is enough and avoids unnecessary report recalculations."},
{"pos": "456", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Currency"},
{"pos": "457", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Multipliers"},
{"pos": "458", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Maturity date"},
{"pos": "459", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Coupon\/fixing information"},
{"pos": "460", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Ex-post costs (only prior to FA 3.9 - from FA 3.9 onward, changing security's ex-post costs automatically triggers the necessary report recalculations. Report data is automatically recalculated when from the oldest modified ex-post date onward, and no longer requires an update.)"},
{"pos": "461", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Code (only prior to FA 3.10 - from FA 3.10 onward, changing security’s code no longer requires “Save and close (update)”. Report data no longer depends on security codes, and thus changing the code no longer requires an update - your positions are up-to-date even when security codes are changed.)"},
{"pos": "462", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Copy as new"},
{"pos": "463", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Copies all of the existing security's information as a base for you to create a new security with a new code. This function copies all other security information except for the Security code and content of the Market data info tab."},
{"pos": "464", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Translate"},
{"pos": "465", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Allows you to add translations for the security name and description. This allows you to have different, translated names for your securities, that can for example be used in reporting in different languages."},
{"pos": "466", "title":"Saving security", "document":["FA Back reference"], " ":[], "url":"security-window.html#saving-security", "body":"Saving a security is audited when saving the security might result in report recalculations - user audit tracks user clicks Save and close (update) button or saving and closing the Security window after modifying security's market data. Every time a user clicks Save and close (update) in the Security window, user audit contains a message ”User [username] clicked Save and close (update) in Security window for security [code]”, and every time a user updates security's market data through the Market data info tab and closes the window (either through first clicking Save and then closing the window or directly clicking roleSave&close), user audit contains a message ”User [username] closed the Security window for security [code]”. Also, every time a report recalculation is started, the system audit logs which portfolios' reports are recalculated and from which date onward. (Available from FA 3.9 onward)"},
{"pos": "467", "title":"Related links", "document":["FA Back reference"], " ":[], "url":"security-window.html#related-links-3", "body":"Manage securities in FA User guide"},
{"pos": "468", "title":"Preferences - Securities", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html", "body":"Security preferences allow you to set the options available in the fields when defining the basic information of a security in the Basic info tab on the Security window. This allows you to flexibly group and categorize your securities."},
{"pos": "469", "title":"Asset classes and types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#asset-classes-and-types", "body":"Asset classes and types can be defined in the Asset classes and Asset types window in the Preferences. The definition of the asset classes and types has three levels: you can define asset groups on the highest level, asset classes on the middle level, and on the lower level you can define asset types for the asset classes."},
{"pos": "470", "title":"Asset classes and types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#asset-classes-and-types", "body":"You can modify the order of the asset groups, classes and types by dragging the asset group, class or type to the preferred position in the listing. You can also move asset types from an asset class to another. When the order of the asset classes and types has bee changed, the new order has to be saved with the Update order button. The order saved for the asset classes and types is used for example to show the asset classes and types in reports."},
{"pos": "471", "title":"Asset classes and types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#asset-classes-and-types", "body":"A new asset group is added with the Add group button. An asset group consists of a code and a name: the code is used to identify the asset group in the system, and the name is used to view and choose the asset group in the user interface and reports. The asset group represents a set of asset classes and types: you can define different sets of asset classes and types under each group. For example, geographical allocations can be defined in a different asset group from industry-based allocations."},
{"pos": "472", "title":"Asset classes and types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#asset-classes-and-types", "body":"A new asset class is added with the Add asset class button under a defined asset group. An asset class consists of a code and a name: the code is used to identify the asset class in the system, and the name is used to view and choose the asset class in the user interface and reports. The asset classes represent the higher level classifications within an asset group."},
{"pos": "473", "title":"Asset classes and types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#asset-classes-and-types", "body":"A new asset type is added with the Add asset type button under a defined asset class. An asset type consists of a code a name and a status: the code is used to identify the asset class in the system, the name is used to view and choose the asset class in the user interface and reports and the status is used to determine whether the type is available for securities (choose between Active and Passive). The asset classes represent the lower level classifications."},
{"pos": "474", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"In the manage parameters tab you can manage and modify the parameters, such as the volatility and expected return, for the saved asset types. The parameters can only be defined for asset types, not the main level asset classes."},
{"pos": "475", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"You can modify the parameters with the Edit button at the bottom of the window. The parameter information of asset types is divided into columns:"},
{"pos": "476", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"Name"},
{"pos": "477", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"The asset type name."},
{"pos": "478", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"Volatility %"},
{"pos": "479", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"The volatility percent of the asset type."},
{"pos": "480", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"Expected return %"},
{"pos": "481", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"The expected return percent of the asset type."},
{"pos": "482", "title":"Manage parameters", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#manage-parameters", "body":"The modified parameters can be saved with the Save button. The Cancel button closes the edit mode without saving."},
{"pos": "483", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"In the Export\/import correlations tab you can modify the correlations between the asset types. Correlations are shown in the tab as a matrix, and the correlations can be modified with an Excel file. To modify the correlations, export the correlations to an Excel file with the Export button, make the necessary changes and import the modified correlation file back to the system with the Upload file button."},
{"pos": "484", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"There are three buttons visible:"},
{"pos": "485", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"Export"},
{"pos": "486", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"Export - export the correlations as an Excel file to enable modification of the correlations"},
{"pos": "487", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"Upload file"},
{"pos": "488", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"- import the modified correlation file back to the system to modify correlations"},
{"pos": "489", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"Save"},
{"pos": "490", "title":"Export\/import correlations", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#export-import-correlations", "body":"- save the changes made to the correlation matrix with the exported and imported file"},
{"pos": "491", "title":"Asset type - benchmark", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#asset-type---benchmark", "body":"The Asset type- benchmark tab can be accessed with the Benchmark button under each asset type. The tab allows you to create a Benchmark to the asset type, similar to creating a benchmark to a portfolio."},
{"pos": "492", "title":"Base currency", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#base-currency", "body":"Base currency preferences allows you to define the base currency of the system."},
{"pos": "493", "title":"Base currency", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#base-currency", "body":"You can select the system's base currency out of existing securities of the type CURRENCY - if your desired currency is not available, you can add it to the list by creating a new currency security. System's base currency should usually be set according to the currency you are getting most of your FX rates against, and is usually the currency you are using most often in valuating your investments within your portfolios. For example, if most of your portfolios are in EUR, and you are getting most of your FX rates against EUR (EUR\/USD, EUR\/SEK, EUR\/GBP etc.), then your systems base currency should be EUR."},
{"pos": "494", "title":"Base currency", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#base-currency", "body":"System's base currency is used to calculate FX rates for a currency cross that has not been set up in the system - the system can calculate such an FX rate through the base currency, if relevant currency crosses have been define against the base currency. For example, if the system's base currency is EUR and the system would need an FX rate USD\/SEK but it cannot find either USD\/SEK or SEK\/USD currency cross from the system, the system can calculate the USD\/SEK FX rate through currency crosses defined against the base currency EUR, i.e. EUR\/USD and EUR\/SEK (or USD\/EUR and SEK\/EUR, respectively)."},
{"pos": "495", "title":"Block size", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#block-size", "body":"Block size preferences allows you to define the effect of the block size defined in the Security window."},
{"pos": "496", "title":"Block size", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#block-size", "body":"Enable Block size affects multiplier \/ Block size affects multiplier 2 if you want the block size to affect multiplier or multiplier 2 in the Security window. If enabled, when you set a value in the Block size field, the multiplier(s) are automatically set accordingly. This setting helps you configure some types of securities, for example index futures, more easily: you can only set the block size, which will then automatically adjust the multipliers accordingly. By default, neither of the options is selected, and setting a block size has no effect on multipliers."},
{"pos": "497", "title":"Class (1 - 5)", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#class--1---5-", "body":"In the Class preferences you can define the classes available for securities. The classes are used to categorize securities, and the individual categorization systems are free of choice. The classification systems can be in any way useful to the user, and securities can be categorized with up to five different categorization system. For example, you can categorize your securities with the level of risk in Class 1 (e.g. low risk \/ medium risk \/ high risk) and with the credit rating in Class 2."},
{"pos": "498", "title":"Class (1 - 5)", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#class--1---5-", "body":"Classes can be defined in the Class window in the Preferences. A class consists of a code and a name: the code is used to identify the class in the system, and the name is used to view and choose the class in the user interface. Five classification systems are separate: for example, the values defined in Class 1 can only be chosen to the Class 1 field of the security."},
{"pos": "499", "title":"Default holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#default-holiday-calendar", "body":"Default holiday calendar preferences allow you to set the default holiday calendar used when creating a new security. Holiday calendar on a security is used to distinguish business days from holidays, and used for example when setting a settlement date on a trade on the security."},
{"pos": "500", "title":"Default holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#default-holiday-calendar", "body":"Set the default holiday calendar by selecting it from the dropdown. The dropdown lists all available holiday calendars in the system - whichever holiday calendar you select is used as the default holiday calendar for any new security you create. By default, the default holiday calendar is set to \"Saturday\/Sunday weekends (SatSun)\"."},
{"pos": "501", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Holiday calendar preferences provide you with tools to configure holiday calendars, allowing you to flexibly accommodate to different conventions in different markets. Holiday calendars distinguish between business days and holidays, and are used for example in accrued interest and coupon calculations for bonds and to determine settlement dates for transactions and trade orders."},
{"pos": "502", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Holiday calendar preferences allow you either to:"},
{"pos": "503", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Customize system's built-in holiday calendars by adding individual holiday dates."},
{"pos": "504", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"This allows you customize the system's built-in calendars when needed, for example in order to accommodate to individual non-regular holidays on certain markets such as king's funeral on a certain date."},
{"pos": "505", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Configure entirely new holiday calendars."},
{"pos": "506", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"This allows you to build entirely new holiday calendars from scratch for a new market."},
{"pos": "507", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Existing holiday calendars are listed on left. There are three different kinds of calendars you can configure, identified with stars (* or **) in front of the holiday calendar code allowing you to easily distinguish what kind of a calendar you are working with:"},
{"pos": "508", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"**CODE - entirely new holiday calendars. These calendars you can freely modify and delete, since they have been configured from scratch. Once created, you can modify the calendar name, which days are weekend days, and which individual dates are considered as holidays."},
{"pos": "509", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"*CODE - customized built-in holiday calendars. For these calendars, you can manage the custom holiday dates added to built-in calendar, but cannot modify other parameters of the calendar. If you delete this kind of a calendar, you in practice delete the custom dates you have added to the built-in holiday calendar, and fall back to the original system's built-in holiday calendar you customized in the first place."},
{"pos": "510", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"CODE - system's built-in holiday calendars. These calendars you cannot modify or delete, but you can make them customized built-in holiday calendars by adding holiday dates to them."},
{"pos": "511", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"After selecting a holiday calendar from the list, you can manage the calendar through the following fields and buttons:"},
{"pos": "512", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Code"},
{"pos": "513", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Unique holiday calendar code. Editable only for entirely new holiday calendars, system's built-in calendars have fixed codes."},
{"pos": "514", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Name"},
{"pos": "515", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Name of the holiday calendar. Editable only for entirely new holiday calendars, system's built-in calendars have fixed names."},
{"pos": "516", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Weekend days"},
{"pos": "517", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Allows you to tick which weekdays (options from Monday through Sunday) are considered as weekend days within your calendar. For example, if Saturdays and Sundays are weekend days within the market you are configuring the calendar from, ticking Sat and Sun will automatically mark all Saturdays and Sundays as holidays. This setting is only available for entirely new holiday calendars, system's built-in holiday calendars already consider weekend days as holidays as relevant for each market."},
{"pos": "518", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Add a holiday"},
{"pos": "519", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Allows you to manually add a new holiday date to your holiday calendar. Define the holiday date in the available date field and add it with the Add button."},
{"pos": "520", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Import\/Export"},
{"pos": "521", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Allows you to mass-modify the holiday dates within your holiday calendar all at once as text. You can for example easily copy-paste a list of holiday dates from somewhere else to add them to your holiday calendar. Import\/Export allows you to enter holiday dates, each date on its own row with format dd.MM.yyyy - the date format corresponds with the date format configured for your user interfaces language, allowing you to view and add dates with the same date format as you see dates on the screen."},
{"pos": "522", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Preview"},
{"pos": "523", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"Preview icon allows you to easily Preview the selected holiday calendar to check which days are marked as holidays (i.e. non-business days) within your calendar. Preview is available for all kinds of calendars, and allows you to see all dates that are considered as holidays. The calendar is by default opened for current date, but you can navigate back and forward to any date either with the date selector on the top left or with the arrows above the calendar."},
{"pos": "524", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"For entirely new calendars, the preview combines the weekend days you ticked and the holidays you added, and marks all as \"Holidays\"."},
{"pos": "525", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"For customized built-in holiday calendars, the preview combines the holiday dates from the underlying system's built-in holiday calendars and the holidays you have added manually, and marks all as \"Holidays\"."},
{"pos": "526", "title":"Holiday calendar", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#holiday-calendar", "body":"For system's built-in holiday calendars, the preview shows the holiday dates from the system's built-in holiday calendars, and marks them as \"Holidays\"."},
{"pos": "527", "title":"Marketplace", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#marketplace", "body":"In the Marketplace preferences you can define the marketplaces available for securities and transactions and exchanges available for contacts. The marketplace tells, where a security (or a transaction) is traded or in which exchanges a counter operates or a customer's custody lies. For example, the market places can include markets where securities are traded or trades are executed, such as OMX or NASDAQ."},
{"pos": "528", "title":"Marketplace", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#marketplace", "body":"Marketplaces can be defined in the Marketplace window in the Preferences. A marketplace consists of a code and a name: the code is used to identify the marketplace in the system (if using for example SWIFT messages, define the valid MIC code for the marketplace), and the name is used to view and choose the marketplace in the user interface."},
{"pos": "529", "title":"Marketplace", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#marketplace", "body":"In addition, you can define additional details to your marketplaces: these details include fields for Type, Country, MIC and Operating MIC. These details can for example be used when sending out your trades. This information is also available as selectable columns on the Securities view, allowing you to easily see the details of the marketplace you have linked to your securities."},
{"pos": "530", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Security type Preferences allow you to define the security types available for your securities. Security types are derived from a set of system-level \"basic types\", and define the characteristics of the securities of that type, how the securities of this type are managed in calculations, and what Transaction types are linked to this security type. For example, you can have multiple security types derived from the basic type FUND, such as \"Mutual fund\" and \"ETF\": both are derived from the same basic type FUND, but can otherwise have different characteristics."},
{"pos": "531", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Security type Preferences allow you to manage your security types. Existing security types are listed on the left - view the characteristics and modify the details of an existing security type through selecting it from the listing. Translate button allows you to save translations for the security type to be used in reports and the user interface, when a language other than the language of the security type is chosen."},
{"pos": "532", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Next to the security type listing, you can find two buttons, Up and Down. These buttons allow you to change the order of the security types in the listing: choose a security type you want to move, and move it up and down the listing with the buttons. Changing the order of the security types affects certain reports and the Overview: these functions order the securities shown based on the security type, and this order is defined by ordering the security types in the Security type preferences."},
{"pos": "533", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"A new security type is added with the Add security type button. The security type information is defined in the fields on the right-hand side of the window. A red star indicates that a field is mandatory."},
{"pos": "534", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Code*"},
{"pos": "535", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"The individual security type code that separates it from other security types."},
{"pos": "536", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Name*"},
{"pos": "537", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"The name of the security type."},
{"pos": "538", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Basic type*"},
{"pos": "539", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Choose the basic type of the security from the alternatives: STOCK, BOND, OPTION, FUTURE, CASH, FUND, DISCOUNT, CURRENCY, DEPOSIT, INDEX, CURRENCY_CROSS, and CONTRACT. Basic type determines what kind of fields are available in the Security window and Transaction window, controls how the security type is handled when calculating your portfolio's positions, and controls where the security is selectable within the system. For more details, see Characteristics of Basic types below."},
{"pos": "540", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Decimal count*"},
{"pos": "541", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Define how many decimals are allowed for the amount in the cash transactions created for this security type. For security types with the base type CURRENCY, decimal count also determines how many decimals are used to show \"cash\" within the system. For example, if you handle cash (prices, costs, taxes, trade amounts, etc.) with three decimals, set the CURRENCY security type's decimal count to 3."},
{"pos": "542", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"You can also define the number of decimals on the security level in the Security window, Block size field. For details, see Security window."},
{"pos": "543", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Valuation method"},
{"pos": "544", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Define how the positions of this type are valuated within your portfolios through the alternatives: Use portfolio's valuation method (default), Always use FIFO or Always use average price. By default, all positions are valuated according to the valuation method you have set on your portfolio in your portfolio basic info - however, you can override the portfolio's valuation method on the security type level if needed. For example, your custody might valuate certain positions differently than you have chosen to valuate your portfolios - even though you value your portfolios with \"average price\", you can override the valuation for \"futures\" to always be \"FIFO\", or even though you value your portfolios with \"FIFO\", you can override the valuation for \"private equity\" to always be \"average price\"."},
{"pos": "545", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"TWR calculation"},
{"pos": "546", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Define which TWR calculation method is used for the security type. See TWR calculation logic for more details on the methods and related calculations. (Available from FA 3.8 onward)"},
{"pos": "547", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Default logic - If security is defined to be “Future contract” in the security type configuration, the method is Exposure based, otherwise it is Market value based. Accounts\/cash uses Carry costs\/profits to portfolio level logic. This is the default selection for security types."},
{"pos": "548", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Based on market value - Use Market value as the base value in the TWR calculation."},
{"pos": "549", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Based on exposure - Use Absolute exposure as the base value in the TWR calculation."},
{"pos": "550", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Carry costs\/profits to portfolio level - Uses market value based TWR, but carries costs\/profits to portfolio level. This means costs\/profits does not affect the position level TWR but are taken into account on portfolio level TWR. Normally used e.g. on cash positions to aggregate up portfolio level costs to portfolio level, and not show their effect on account level e.g. management fees."},
{"pos": "551", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Don't calculate TWR on position level - Does not calculate \/ show TWR on positions of securities of this security type."},
{"pos": "552", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Group by type"},
{"pos": "553", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Choose from the alternatives: No, Yes - same or Yes - opposite. The selection defines, whether the securities are grouped by type in the reports, in other words, are positions shown separately (Yes) or calculated together (No)."},
{"pos": "554", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Include in total"},
{"pos": "555", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Choose from the alternatives: Yes, No, Yes (change) or Yes (margin). The selection defines, whether the securities' market values are calculated in the portfolio total as the are (Yes) or not at all (No). Alternatively, the difference between the market value and purchase value can be added to the portfolio total (Yes (change)) or the margin account's value can be used to track the effect on the total value (Yes (margin))."},
{"pos": "556", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Future contract"},
{"pos": "557", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Choose from the alternatives: No, Yes - charge cost later or Yes - charge cost immediately. The selection defines, whether the security is a forward type security and the transaction realizes in the future (Yes options) and whether the costs of such a transaction are charged immediately (Yes - charge cost immediately) or when the transaction realizes (Yes - charge cost later)."},
{"pos": "558", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Links to transaction types"},
{"pos": "559", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Define the transaction types to be used with this security type, defined in the Transaction types preferences. The transaction types are listed with the transaction type codes defined in the transaction type preferences. The available transaction types are listed on the left-hand side of this section, and the transaction types linked to the security type are listed on the right-hand side section. A transaction type is linked to the security type by choosing the desired transaction type from the left-hand side listing and pressing the >> button, when the transaction type is moved to the linked transaction types listing on the right-hand side. Similarly, a transaction type can be removed from the linked transaction types by choosing it from the right-hand side listing and pressing the << button. Only the transaction types linked to a security can be chosen as the transaction type of the transaction created to the security type."},
{"pos": "560", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Subtype"},
{"pos": "561", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"The sub types defined for the security type. The subtypes are more detailed description of the basic security types: for example, a security type bond could have subtypes fixed rate bond, floating rate note, convertible bond and government bond. The sub types are listed in this section: subtypes can be modified with the Modify button below the subtype listing."},
{"pos": "562", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"The security type is saved with the Save button below the fields."},
{"pos": "563", "title":"Security types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#security-types", "body":"Changes in security types are audited - user audit tracks changes users make in Security type Preferences. Every time a user makes a change in security types, user audit contains a message ”User [username] created\/modified\/deleted security type [code]”. (Available from FA 3.9 onward)"},
{"pos": "564", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"Security's Basic type determines what kind of fields are available in the Security window and Transaction window for creating this type of a security or when creating transactions for this type of a security, controls how the security type is handled when calculating your portfolio's positions, and controls where the security is selectable within the system. The table below summarizes the built-in characteristics of the available Basic types."},
{"pos": "565", "title":"Settlement place", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#settlement-place", "body":"In the Settlement place preferences you can define the settlement places available for securities and transactions. The settlement place tells, where a transaction (or a security) is settled. For example, the settlement places can include settlements such as Euroclear."},
{"pos": "566", "title":"Settlement place", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#settlement-place", "body":"Settlement places can be defined in the Settlement place window in the Preferences. A settlement place consists of a code and a name: the code is used to identify the settlement place in the system (if using for example SWIFT messages, define the valid BIC code for the settlement place), and the name is used to view and choose the settlement place in the user interface."},
{"pos": "567", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Queries view allows you to make customized searches against the FA database in SQL. Queries is an efficient way of searching and aggregating information that is not directly supported by the other search views. Queries can be used for example for mass searches and aggregating information."},
{"pos": "568", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"You can use queries either for ad-hoc searches, or you can save your queries for later use. When you save your query for later use, you can give it a descriptive name and decide who to share it with."},
{"pos": "569", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"You can:"},
{"pos": "570", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Make ad-hoc searches. Click Show query to enter the query, and then click Search. If a query takes too long or if you need to edit the parameters, click Stop."},
{"pos": "571", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Save your queries for later use. When you save your query for later use, you can give it a descriptive name and decide who to share it with."},
{"pos": "572", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Export the results of any query as PDF or XLS."},
{"pos": "573", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Use your saved queries as sections within your Dashboard - If your query returns at least one numeric value, instead of showing the data as a table, you can draw the results of your query as a chart on the Dashboard."},
{"pos": "574", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Save your saved queries as a report template - If your query supports the $P(portfolioId) parameter, you can save your query as a report template and use it as any other report. The queries saved as report templates are identified with the file icon within the saved query tab."},
{"pos": "575", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Show data to your logged-in users in FA Front."},
{"pos": "576", "title":"Queries view", "document":["FA Back reference"], " ":[], "url":"queries-view.html", "body":"Stop query execution if you want to cancel your search."},
{"pos": "577", "title":"Fund wizard", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html", "body":"The Fund wizard lets you set up a fund or edit settings for an existing fund in FA Fund Management app. When you set up a fund in the FA Fund management app, FA creates a fund portfolio with the specified properties in FA Back to store the fund information and manage fund investments."},
{"pos": "578", "title":"Fund wizard", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html", "body":"To set up a new fund, click the Add fund button at the top-right of the NAV status view. To view and edit the settings of an existing fund, click the Edit fund button in the Fund details pane."},
{"pos": "579", "title":"Fund wizard", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html", "body":"The Fund wizard fields are described below."},
{"pos": "580", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"The Basic info tab contains the basic information about the fund."},
{"pos": "581", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Fund company*"},
{"pos": "582", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"A company the fund is administered by. Choose the company from the list of contacts available in FA Back."},
{"pos": "583", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Language*"},
{"pos": "584", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"The language to be used in portfolio reports. If the language is filled in the fund company's contact in FA Back, it is automatically copied to the Fund wizard when you set up a fund."},
{"pos": "585", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Juridical*"},
{"pos": "586", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Juridical form of the fund company. Copied from the company's contact in FA Back."},
{"pos": "587", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Name*"},
{"pos": "588", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Fund name."},
{"pos": "589", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"ID*"},
{"pos": "590", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"A unique fund ID used to identify the fund and search for funds. Best practice is not to include special characters in the ID – only use numbers and letters (a-z)."},
{"pos": "591", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Currency*"},
{"pos": "592", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Fund currency. Once you create a fund, the currency can't be changed."},
{"pos": "593", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Valuation method*"},
{"pos": "594", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Valuation method for the fund portfolio:"},
{"pos": "595", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Average price"},
{"pos": "596", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Average price with adjustments – Uses transaction types that control the market value of the positions with the transaction's trade amount, such as Private Equity transaction types."},
{"pos": "597", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Average price with separate items – Valuates portfolio with average price, but keeps track of original purchase dates."},
{"pos": "598", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"FIFO"},
{"pos": "599", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"FIFO (combined) – Valuates the portfolio based directly on transactions in the subportfolios."},
{"pos": "600", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"FIFO with adjustments – Uses transaction types that control the market value of the positions with the transaction's trade amount, such as Private Equity transaction types."},
{"pos": "601", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Type*"},
{"pos": "602", "title":"Basic info tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#basic-info-tab", "body":"Portfolio type. Choose the type that corresponds to the fund portfolio."},
{"pos": "603", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Cash accounts for the fund."},
{"pos": "604", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Name*"},
{"pos": "605", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Account name."},
{"pos": "606", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Currency*"},
{"pos": "607", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Account currency."},
{"pos": "608", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Account number*"},
{"pos": "609", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"The account number, for example the bank account number."},
{"pos": "610", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Set as default account"},
{"pos": "611", "title":"Cash accounts", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-accounts", "body":"Set account as the default account of the portfolio. All transactions are by default created against this account."},
{"pos": "612", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The NAV schedules tab contains schedule settings for calculating NAV, fees, and unofficial NAV for the fund. Schedules let you track your fund's status. For example, you can see if NAV or fees have to be calculated today. You need to fill the dates only once. After that, dates are updated every time you accept the calculation."},
{"pos": "613", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"NAV schedules tab features settings for different workflows. You can set a schedule to calculate:"},
{"pos": "614", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"NAV and fees as a part of regular NAV calculation workflow."},
{"pos": "615", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Fees, in addition to the regular NAV calculation schedule, between the regular NAV calculation dates (to set a schedule for this workflow, click Add separate fee calculation schedule)."},
{"pos": "616", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Unofficial NAV for reporting purposes between the scheduled regular NAV calculations (to set a schedule for this workflow, click Add unofficial NAV calculation schedule)."},
{"pos": "617", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"To learn more about calculation workflows, see Workflows and NAV statuses."},
{"pos": "618", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Frequency"},
{"pos": "619", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Calculation frequency."},
{"pos": "620", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Holiday calendar"},
{"pos": "621", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The holiday calendar to take into account in the calculation schedule. If you don't find a suitable holiday calendar from the list, you can create a calendar in FA Back (for details, see Holiday calendar in the FA Back reference)."},
{"pos": "622", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Roll convention"},
{"pos": "623", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Calculation schedule based on the day of the month or day of the week. One of the most common roll conventions is \"EOM\" (end-of-month)."},
{"pos": "624", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"You set the calculation frequency to \"Every three months\" and the first calculation date is on June 30th. The calculation dates will fall on the 30th of each month (September 30th, December 30th, March 30th, and so on). For months with 31 days, the calculation date won't be the last day of the month. If you choose the \"End of Month (EOM)\" roll convention, the system will recognize that June 30th is the last day of the month, and the calculation dates will fall on the last day of each month (September 30th, December 31st, March 31st, and so on)."},
{"pos": "625", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Business day convention"},
{"pos": "626", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Business day convention determines how to adjust a date if it falls on a non-business day. "},
{"pos": "627", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"First NAV date"},
{"pos": "628", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The date for which NAV is calculated for the first time."},
{"pos": "629", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Previous NAV date"},
{"pos": "630", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The date for which the latest NAV was calculated. For the newly created fund, previous NAV date must be the same as the first NAV date."},
{"pos": "631", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Calculation delay in days"},
{"pos": "632", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The number of days between the NAV date and the calculation date. Enter \"0\" to calculate NAV ont he same date, or choose the number of days to calculate NAV with a delay."},
{"pos": "633", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Calculate next days"},
{"pos": "634", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The button sets the next NAV date and calculation dates according to the information entered above."},
{"pos": "635", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Next NAV date"},
{"pos": "636", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"The next NAV date based on the frequency, holiday calendar conventions and the first NAV date chosen above."},
{"pos": "637", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Previous calculation date"},
{"pos": "638", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Previous calculation date based on the based on the previous NAV date and calculation delay."},
{"pos": "639", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Next calculation date"},
{"pos": "640", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Next calculation date based on the next NAV date and calculation delay"},
{"pos": "641", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"The Fee structure tab lets you set or edit the fees applied to the whole fund. Click the Add fee button to add more than one fee formula."},
{"pos": "642", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"To add fees per share class, use the Share class wizard."},
{"pos": "643", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Fee formula"},
{"pos": "644", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Fee formula used to calculate the fee and generate fee transaction."},
{"pos": "645", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Fee transaction type"},
{"pos": "646", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Transaction type linked to the chosen fee formula."},
{"pos": "647", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Percentage"},
{"pos": "648", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Fee percentage."},
{"pos": "649", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Calculate fee per security"},
{"pos": "650", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Run the formula multiple times, for each security in the fund investment portfolio. Used, for example, for kickbacks."},
{"pos": "651", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Include in income distribution"},
{"pos": "652", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Include the fee in the income distribution calculation."},
{"pos": "653", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Formula sets its own account"},
{"pos": "654", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Create an account for the fee formula. For example, it can be useful with accrued account interest transactions over multiple accounts."},
{"pos": "655", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Include in income distribution"},
{"pos": "656", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Include the fee in the income distribution calculation."},
{"pos": "657", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Include fees calculated since the previous NAV calculation date in the current NAV calculation (if fees are calculated separately from NAV)."},
{"pos": "658", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Take the fees calculated since previous NAV calculation into account when calculating the current NAV."},
{"pos": "659", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Allocate fees per share class from the beginning of the fund (for example, for private equity funds)."},
{"pos": "660", "title":"Fee structure tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fee-structure-tab", "body":"Calculate fees per share class since the beginning of the fund (not since the latest NAV calculation). To learn more, see NAV calculation."},
{"pos": "661", "title":"Fund reporting tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fund-reporting-tab", "body":"The Fund reporting tab lets you define the settings to produce fund reporting data, including fund KPIs, and store it in the FA Fund Management app (see Fund reporting view for details). Click Enable fund reporting and fill in the fields."},
{"pos": "662", "title":"Fund reporting tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fund-reporting-tab", "body":"Reporting schedule"},
{"pos": "663", "title":"Fund reporting tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fund-reporting-tab", "body":"The settings for the fund reporting schedule are similar to the NAV schedules (see NAV schedules tab)."},
{"pos": "664", "title":"Fund reporting tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fund-reporting-tab", "body":"Allocation groups"},
{"pos": "665", "title":"Fund reporting tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#fund-reporting-tab", "body":"Allocation groups to analyze the fund portfolio contents. To learn more about allocations, see Allocation in the FA Back reference."},
{"pos": "666", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"The Order execution tab lets you define and edit the automatic trade order execution settings."},
{"pos": "667", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Cut-off time"},
{"pos": "668", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"The cut-off time for the fund in 24 h format, for example, “13:00”. After you set the cut-off time, you can use decision tables make sure that certain transactions or trade orders that come after the cut-off time don't affect the NAV calculation. To learn more, see Set up a mutual fund."},
{"pos": "669", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Enable automatic order execution"},
{"pos": "670", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Enable automatic order execution and create transactions ofr the fund when NAV is accepted."},
{"pos": "671", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Default transaction types"},
{"pos": "672", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Transaction types for the cash transactions (unit holder deposits and withdrawals)."},
{"pos": "673", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Account for cash transactions"},
{"pos": "674", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Account number for the cash transactions. Leave the field empty to use the default account."},
{"pos": "675", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Transaction types for bookkeeping"},
{"pos": "676", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"For bookkeeping purposes, you can provide transaction types that are used when creating cash transaction for client orders whose settlement date doesn’t follow the default logic."},
{"pos": "677", "title":"Order execution tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#order-execution-tab", "body":"Leave these transaction types empty to use the accounts for cash transactions instead."},
{"pos": "678", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Settlement cycle"},
{"pos": "679", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Setting to define the settlement date for subscriptions and redemptions if it is missing in the client order. Enter the number of days after the transaction date."},
{"pos": "680", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Account for client transactions"},
{"pos": "681", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Account used for client transactions created from trade orders."},
{"pos": "682", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Use the account of the trade order to transactions"},
{"pos": "683", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Use the currency account (or default account) to transactions"},
{"pos": "684", "title":"Client orders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#client-orders", "body":"Use the default account to transactions"},
{"pos": "685", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"Default transaction types"},
{"pos": "686", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"Transaction types for the cash transactions (unit holder deposits and withdrawals)."},
{"pos": "687", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"Account for cash transactions"},
{"pos": "688", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"Account number for the cash transactions. Leave the field empty to use the default account."},
{"pos": "689", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"Transaction types for bookkeeping"},
{"pos": "690", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"For bookkeeping purposes, you can provide transaction types that are used when creating cash transaction for client orders whose settlement date doesn’t follow the default logic."},
{"pos": "691", "title":"Cash transactions for the fund", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#cash-transactions-for-the-fund", "body":"Leave these transaction types empty to use the accounts for cash transactions instead."},
{"pos": "692", "title":"NAV reporting tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-reporting-tab", "body":"The NAV reporting tab features custom templates for the NAV reports. If you have custom NAV reports, enter the template paths and template names in the fields. Example path: \"\/NAV\/NAV Report\"."},
{"pos": "693", "title":"Swing pricing", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#swing-pricing", "body":"The Swing pricing tab lets you define the settings for swing pricing. Click Apply swing pricing and fill in the fields."},
{"pos": "694", "title":"Swing percentage", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#swing-percentage", "body":"Swing percentage is the swing factor used to adjust the unit price with."},
{"pos": "695", "title":"Swing percentage", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#swing-percentage", "body":"For swinging up"},
{"pos": "696", "title":"Swing percentage", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#swing-percentage", "body":"The percentage to adjust the unit price if the net inflow of the fund exceeds the threshold."},
{"pos": "697", "title":"Swing percentage", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#swing-percentage", "body":"For swinging down"},
{"pos": "698", "title":"Swing percentage", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#swing-percentage", "body":"The percentage to adjust the unit price if the net outflow of the fund exceeds the threshold."},
{"pos": "699", "title":"Thresholds", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#thresholds", "body":"Swing thresholds are the net inflow or net outflow of the fund that triggers the adjustment to the NAV. You can set a threshold in the fund currency or as a percentage of the fund's NAV."},
{"pos": "700", "title":"Thresholds", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#thresholds", "body":"For swinging up"},
{"pos": "701", "title":"Thresholds", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#thresholds", "body":"Net inflow that triggers swinging up"},
{"pos": "702", "title":"Thresholds", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#thresholds", "body":"For swinging down"},
{"pos": "703", "title":"Thresholds", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#thresholds", "body":"Net outflow that triggers swinging down."},
{"pos": "704", "title":"Income distribution", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#income-distribution", "body":"The Income distribution tab lets you define the settings for income distribution. The income distribution components are calculated based on the balances of the specified bookkeeping accounts on the NAV date."},
{"pos": "705", "title":"Income distribution", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#income-distribution", "body":"Click Enable income distribution and fill in the fields."},
{"pos": "706", "title":"Income distribution", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#income-distribution", "body":"Accounts"},
{"pos": "707", "title":"Income distribution", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#income-distribution", "body":"Fields for bookkeeping accounts. To enter multiple account numbers, separate them with semicolon. To include only part of the account balance in the calculation, enter a percentage after the account number. For example, \"123456=45,5\" means that 45,5% of the 123456 account balance is used in the calculation."},
{"pos": "708", "title":"Income distribution", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#income-distribution", "body":"Mark all “Ready” bookkeeping postings from start of the year to the NAV date as “Reported” when NAV is accepted"},
{"pos": "709", "title":"Income distribution", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#income-distribution", "body":"Change the status of bookkeeping postings produced by income distribution when the NAV is accepted. In most cases, you need to have this option selected."},
{"pos": "710", "title":"Breakdown of income distribution in cash transactions", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#breakdown-of-income-distribution-in-cash-transactions", "body":"Tax and cost types to show in the transaction fields (this selection is available only if you have automatic order execution selected)."},
{"pos": "711", "title":"Breakdown of income distribution in cash transactions", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#breakdown-of-income-distribution-in-cash-transactions", "body":"These settings let you define the transaction cost types to show in the Par value cost type, Over\/ under cost type , Income distribution tax type, Swing tax type fields of the fund transaction."},
{"pos": "712", "title":"Accounting", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#accounting", "body":"The Accounting tab lets you define accounts and rules for posting generation."},
{"pos": "713", "title":"Accounting", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#accounting", "body":"Automated deferral runs before NAV calculation"},
{"pos": "714", "title":"Accounting", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#accounting", "body":"Settings for deferral runs before NAV calculation. To run deferrals before every NAV calculation, you need to have this functionality enabled in FA. Choose the deferral type to run and the previous deferral date. If the previous deferral date is empty, the starting date of the fund is used."},
{"pos": "715", "title":"Accounting", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#accounting", "body":"Rules"},
{"pos": "716", "title":"Accounting", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#accounting", "body":"Accounting rules to generate postings when you accept NAV. This option allows you to use separate accounting rules for fund-related postings."},
{"pos": "717", "title":"Advanced settings", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#advanced-settings", "body":"The Advanced settings tab contains miscellaneous settings for your fund."},
{"pos": "718", "title":"Unit certificates", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#unit-certificates", "body":"Setting for unit certificates. To learn more about unit certificates in the FA Fund management app, see the Unit certificate"},
{"pos": "719", "title":"Unit certificates", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#unit-certificates", "body":"Report template (PDF)"},
{"pos": "720", "title":"Unit certificates", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#unit-certificates", "body":"The path to the custom Unit certificate template. For example, \"\/UnitCertificateCustom\/Unit certificate\"."},
{"pos": "721", "title":"Unit certificates", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#unit-certificates", "body":"Transaction types"},
{"pos": "722", "title":"Unit certificates", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#unit-certificates", "body":"Transaction types for the unit certificate to show in the Shareholder registry view. If empty, only the UC type is shown."},
{"pos": "723", "title":"Pricing of share class without shareholders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#pricing-of-share-class-without-shareholders", "body":"Define how the unit price for newly created share classes with no shareholders is set:"},
{"pos": "724", "title":"Pricing of share class without shareholders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#pricing-of-share-class-without-shareholders", "body":"Select the checkbox to use the previous price of the share class."},
{"pos": "725", "title":"Pricing of share class without shareholders", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#pricing-of-share-class-without-shareholders", "body":"Leave the checkbox empty to use the price from the share class with a higher priority."},
{"pos": "726", "title":"Allocation", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#allocation-7", "body":"Select the checkbox and choose the allocation groups to update share class allocations based on fund portfolio contents when you accept NAV. Allocations are updated for the configured group(s), based on fund portfolio’s allocations on the NAV date."},
{"pos": "727", "title":"NAV report (PDF)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--pdf-.html", "body":"NAV report contains details of NAV calculation that you can see in the NAV window tabs. You can download NAV report in PDF format in the NAV window (see NAV window for details)."},
{"pos": "728", "title":"NAV report (PDF)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--pdf-.html", "body":"The Summary of calculated NAV section shows the summary of the current NAV calculation."},
{"pos": "729", "title":"NAV report (PDF)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--pdf-.html", "body":"The Details of calculated NAV section shows details for each NAV calculation item: Market value of investments, Accrued interests, Account balances, Receivables, Liabilities, Fees. (See the Table rows description in the NAV summary tab)."},
{"pos": "730", "title":"NAV report (PDF)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--pdf-.html", "body":"The Summary of share class NAVs section shows NAV calculation by share class (see the Table columns description in Share classes tab)."},
{"pos": "731", "title":"NAV report (PDF)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--pdf-.html", "body":"The Portfolio section shows portfolio positions (see the Table columns description in Portfolio tab). You can choose the portfolio position information that is included in the report. To do this, select the columns in the Portfolio tab by clicking the button before you generate the report."},
{"pos": "732", "title":"NAV report (PDF)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--pdf-.html", "body":"The Warnings section shows four types of warnings generated as a result of NAV calculation (for details, see the Warnings tab section)."},
{"pos": "733", "title":"NAV report (XLS)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--xls-.html", "body":"NAV report contains details of NAV calculation that you can see in the NAV window tabs. You can download NAV report in the XLS format in the NAV window (see NAV window for details)."},
{"pos": "734", "title":"NAV report (XLS)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--xls-.html", "body":"The Preview summary section shows the summary of the current NAV calculation."},
{"pos": "735", "title":"NAV report (XLS)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--xls-.html", "body":"The Share class section shows NAV calculation by share class (see the Table columns description in Share classes tab)."},
{"pos": "736", "title":"NAV report (XLS)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--xls-.html", "body":"The Portfolio section shows portfolio positions (see the Table columns description in Portfolio tab). You can choose the portfolio position information that is included in the report. To do this, select the columns in the Portfolio tab by clicking the button before you generate the report."},
{"pos": "737", "title":"NAV report (XLS)", "document":["FA Fund management reference"], " ":[], "url":"nav-report--xls-.html", "body":"The Warnings section shows four types of warnings generated as a result of NAV calculation (for details, see the Warnings tab section)."},
{"pos": "738", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"Activate\/ Deactivate user"},
{"pos": "739", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"Switch the user’s status. Deactivated user can’t log in to FA. We recommend using this option instead of deleting the user – this maintains the user's history while preventing them from accessing FA."},
{"pos": "740", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"Edit user info"},
{"pos": "741", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"For more information about the user details, see the Information block section below."},
{"pos": "742", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"Edit user roles"},
{"pos": "743", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"For more information about the user roles, see the Roles block section below."},
{"pos": "744", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"Delete user"},
{"pos": "745", "title":"Buttons", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#buttons", "body":"Delete a user and all user information from the system. A deleted user can’t log in, and user information is no longer available. If you just want to disable a user and prevent them from logging in, consider deactivating the user instead of deleting."},
{"pos": "746", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"User ID (required)"},
{"pos": "747", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"A unique user ID used to log in to FA and log the user's activities."},
{"pos": "748", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Email (required)"},
{"pos": "749", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"The user’s email used to send a password reset link to the user, if the user clicks Forgot password on the login page."},
{"pos": "750", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"First name, Last name"},
{"pos": "751", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"The user’s first and last name."},
{"pos": "752", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Linked contact"},
{"pos": "753", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"The corresponding contact in FA Back. Linked contact is needed to:"},
{"pos": "754", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Grant access only to certain customers and portfolios (see the How to set up limited visibility for one user and How to set up limited visibility for many users sections in the FA Admin guide)."},
{"pos": "755", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Allow online end users to view their own investments in FA Front. A user that has a linked contact has access to the investment information associated with this contact."},
{"pos": "756", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Linked contact external ID"},
{"pos": "757", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"The user’s external ID received from the external identity provider when the user logs in to FA Front. External ID is used to find a matching contact for the user. If you see this field, this means that FA failed to link a contact to the user. For example, there is no contact with such ID or there are several contacts with this ID stored in FA. In this case, you can add a contact manually in the Linked contact field."},
{"pos": "758", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"The following options are available when you click the Edit button:"},
{"pos": "759", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Force password reset on next login"},
{"pos": "760", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Force the user to reset their password on next login."},
{"pos": "761", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Enable two-factor authentication on next login"},
{"pos": "762", "title":"Information block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#information-block", "body":"Require the user to set up their mobile authenticator app next time they login. For more information, see in the Two-factor authentication block section."},
{"pos": "763", "title":"Roles block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#roles-block", "body":"The Roles block shows the roles assigned to the user. Roles determine:"},
{"pos": "764", "title":"Roles block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#roles-block", "body":"The app the user can access. To access an app, the user needs at least one role within that app. For example, if a user has a role in FA Back, the user is allowed to access FA Back."},
{"pos": "765", "title":"Roles block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#roles-block", "body":"The access rights within the app. For example, FA Back roles determine access rights through permission and FA Front roles determine access rights through the views defined for the role."},
{"pos": "766", "title":"Roles block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#roles-block", "body":"To modify the user’s roles, click the Edit user roles button at the top of the User details pane."},
{"pos": "767", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"The Two-factor authentication block shows you if two-factor authentication is enabled for the user and allows you to turn it on and off. With two-factor authentication, users are required to enter a verification code in addition to their basic credentials (user ID and password) when logging in to FA."},
{"pos": "768", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Two-factor authentication statuses are:"},
{"pos": "769", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Disabled – Two-factor authentication is turned off."},
{"pos": "770", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Enabled – The user has logged in and completed the mobile authenticator setup."},
{"pos": "771", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Pending – You chose “Enable two-factor authentication on next login”, but the user didn’t yet log in to complete the setup. Pending status is available from version 1.4 onward - before that, the status is shown as disabled as long as the user completes the setup."},
{"pos": "772", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"To manage two-factor authentication, use the buttons (available depending on the two-factor authentication status):"},
{"pos": "773", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Enable two-factor authentication"},
{"pos": "774", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Enable two-factor authentication on the next login for the user (available from version 1.4)."},
{"pos": "775", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Cancel two-factor authentication"},
{"pos": "776", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Cancel two-factor authentication request that is pending (available from version 1.4)."},
{"pos": "777", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Disable two-factor authentication"},
{"pos": "778", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"Disable two-factor authentication for the user."},
{"pos": "779", "title":"Two-factor authentication block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#two-factor-authentication-block", "body":"You can also enable or disable two-factor authentication in the Information block."},
{"pos": "780", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"Brute force detection identifies an attempt to guess a user’s password. With brute force detection, the user's account is temporarily disabled after a certain number and frequency of login failures. The user account is disabled for one minute if:"},
{"pos": "781", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"The user enters incorrect credentials twice within a second. This means that someone tries to guess the password programmatically."},
{"pos": "782", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"The user fails to enter correct credentials 5 times. After the account is disabled, every unsuccessful attempt increases the lock by one minute, up to one hour."},
{"pos": "783", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"The Brute force detection block includes the following information:"},
{"pos": "784", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"Status"},
{"pos": "785", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"User account status: Blocked (deactivated by brute force detection), or Unblocked (active). A user blocked by brute force detection has to wait for up to 1 hour (depending on the number of unsuccessful login attempts) for the account to be unblocked."},
{"pos": "786", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"Total login attempts"},
{"pos": "787", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"The number of failed login attempts."},
{"pos": "788", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"Last attempt"},
{"pos": "789", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"The date and time of the last login attempt."},
{"pos": "790", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"IP address"},
{"pos": "791", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"The IP address from which the last login attempt was made."},
{"pos": "792", "title":"Brute force detection block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#brute-force-detection-block", "body":"To activate a blocked user account, choose Unblock and activate. Once unblocked, your user can log in again without waiting for the system to unblock the user after a certain period of time."},
{"pos": "793", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"The Sessions block shows a list of currently active sessions for the user. For example, the same user might have logged in with different browsers, having multiple sessions open at the same time. The list shows:"},
{"pos": "794", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"Application"},
{"pos": "795", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"The apps where the user is logged in within the session. For example, the user might have FA Back and FA Front open in different tabs in the same browser, accessing both applications with a single login and a single session."},
{"pos": "796", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"Last access"},
{"pos": "797", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"The date and time the user accessed an app within the session. If the user accesses only one app, this shows the time they logged in, or if your user accesses multiple apps, this shows the time the user last opened a new app."},
{"pos": "798", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"IP address"},
{"pos": "799", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"Shows the IP address the user is logged in from."},
{"pos": "800", "title":"Sessions block", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#sessions-block", "body":"You can log the user out of all sessions by clicking Logout user from all sessions. The user will be able to use FA for a short time until their authentication expires, then they will get a \"communication problem\" and will be taken to the login page."},
{"pos": "801", "title":"Last logins", "document":["FA Admin console reference"], " ":[], "url":"user-details-pane.html#last-logins", "body":"The Last logins block shows five last dates and times of the user's logins."},
{"pos": "802", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Index convention Calculation mode Lag 1 in months Lag 2 in months"},
{"pos": "803", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Canada, US, France, Germany, Italy, Denmark, Sweden, UK after July 2005 Linear interpolation 2 3"},
{"pos": "804", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"South Africa Linear interpolation 3 4"},
{"pos": "805", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"UK prior to July 2005 Direct 3 -"},
{"pos": "806", "title":"Index calc. method", "document":["FA Back reference"], " ":[], "url":"security-window.html#index-calc--method", "body":"Finland Direct 8 -"},
{"pos": "807", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Convention Description"},
{"pos": "808", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"None Explicitly states that there are no stubs. This option is used to indicate that the schedule evenly divides by the frequency, leaving no stubs. For example, 6 months can be exactly divided by a 3 month frequency."},
{"pos": "809", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Short initial Any remaining period, shorter than the frequency, will be allocated at the start. For example, 8 months with a 3 month frequency would result in a 2 month initial short stub followed by two periods of 3 months."},
{"pos": "810", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Long initial Any remaining period, shorter than the frequency, will be allocated at the start and combined with the next period, making a total period longer than the standard frequency. For example, 8 months with a 3 month periodic frequency would result in a 5 month initial long stub followed by one period of 3 months."},
{"pos": "811", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Smart initial Any remaining period, shorter than the frequency, will be allocated at the start. If this results in a stub of less than 7 days, the stub will be combined with the next period. If this results in a stub of 7 days or more, the stub will be retained. This is the equivalent of Long initial up to 7 days and Short initial beyond that. This convention appears to match that used by Bloomberg."},
{"pos": "812", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Short final Any remaining period, shorter than the frequency, will be allocated at the end. For example, 8 months with a 3 month frequency would result in two periods of 3 months followed by a 2 month final short stub."},
{"pos": "813", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Long final Any remaining period, shorter than the frequency, will be allocated at the end and combined with the previous period, making a total period longer than the standard frequency. For example, 8 months with a 3 month frequency would result in one period of 3 months followed by a 5 month final long stub."},
{"pos": "814", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Smart final Any remaining period, shorter than the frequency, will be allocated at the end. If this results in a stub of less than 7 days, the stub will be combined with the next period. If this results in a stub of 7 days or more, the stub will be retained. This is the equivalent of Long final up to 7 days and Short final beyond that. This convention appears to match that used by Bloomberg."},
{"pos": "815", "title":"Stub convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#stub-convention", "body":"Both Both ends of the schedule have a stub. Days before the first period start date form the initial stub. Days after the last period end date form the final stub."},
{"pos": "816", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Convention Description"},
{"pos": "817", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Following (default) Move to the next valid business day."},
{"pos": "818", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Modified following (without crossing month end) Move to the next valid business day, unless that is in the next month in which case move to the previous valid business day."},
{"pos": "819", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Modified following (without crossing mid-month or month end) Move to the next valid business day, unless that is after the 15th of the month OR in the next month in which case move to the previous valid business day."},
{"pos": "820", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Preceding Move to the previous valid business day."},
{"pos": "821", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Modified preceding (without crossing month start) Move to the previous valid business day, unless that is in the previous month in which case move to the next valid business day."},
{"pos": "822", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"Nearest For Sunday and Monday, move to the next valid business day, for all other days, move to the previous valid business day."},
{"pos": "823", "title":"Business day convention", "document":["FA Back reference"], " ":[], "url":"security-window.html#business-day-convention", "body":"No adjustment Make no adjustment."},
{"pos": "824", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"Basic type Security window Transaction window Position calculation"},
{"pos": "825", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"STOCK All standard security fields available."},
{"pos": "826", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"BOND All standard security fields available. All Extra info fields available."},
{"pos": "827", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"OPTION All standard security fields available. Selected Extra info fields available at the top of the tab."},
{"pos": "828", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"FUTURE All standard security fields available. Selected Extra info fields available at the top of the tab."},
{"pos": "829", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"CASH Not relevant \/ not used. Security types based on CASH are used to record cash transactions, without a link to a security."},
{"pos": "830", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"FUND All standard security fields available."},
{"pos": "831", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"DISCOUNT All standard security fields available. Selected Extra info fields available at the top of the tab. Security types based on DISCOUNT are also used when the system stores future cashflows on FX Contracts. Such securities are created automatically, and certain fields are disabled - more details. You can also create DISCOUNT securities manually."},
{"pos": "832", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"CURRENCY Only relevant fields for currencies are available - more details."},
{"pos": "833", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"DEPOSIT All standard security fields available. All Extra info fields available."},
{"pos": "834", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"INDEX All standard security fields available. Selected Extra info fields available at the top of the tab."},
{"pos": "835", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"CURRENCY_CROSS Only relevant fields for currency crosses are available - more details."},
{"pos": "836", "title":"Characteristics of Basic types", "document":["FA Back reference"], " ":[], "url":"preferences---securities.html#characteristics-of-basic-types", "body":"CONTRACT All standard security fields available. Security types based on CONTRACT are mainly used when the system stores FX Contracts. Such securities are created automatically, and certain fields are disabled - more details."},
{"pos": "837", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"# Code Required Name Description"},
{"pos": "838", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"1 tr.parentPortfolio Yes Portfolio ID String (unique ID of the transaction's portfolio)"},
{"pos": "839", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"2 tr.extId Transaction External ID External ID \/ number of you transaction. If left empty, an external ID is generated for the transaction by the system. In addition, system defines an internal ID as well. External ID is used in combination with #1 Portfolio ID to update existing transactions - if your external ID already exists, the existing transaction is updated."},
{"pos": "840", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"3 tr.type Yes Type Type code (configured in the system). E.g. buy, sell etc."},
{"pos": "841", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"4 tr.status Yes Status Define as a code: OK = Accepted DEL = Deleted NF = Not finished"},
{"pos": "842", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"5 tr.transactionDate Yes Transaction date yyyy-MM-dd"},
{"pos": "843", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"6 tr.settlementDate No Settlement date yyyy-MM-dd In addition, you can use numbers between 1 and 99 to set the settlement date (the settlement date is set the inserted number of business days after the transaction date). The transaction's security's (or cash transaction's currency's) holiday calendar is used to determine which days are business days."},
{"pos": "844", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"7 tr.maturityDate No Maturity date Not used. Only available for transactions on securities with base type DEPOSIT (not regular deposit transactions). Use format yyyy-MM-dd."},
{"pos": "845", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"8 tr.security No Security Security code of the transaction's security. Leave empty, if a cash transaction. In addition to security code, importing transactions is supported with ISIN code, trade code or update codes 1 through 3. When importing transactions by using ISIN code to identify the security, the system checks that the transaction’s currency (column #11 Currency) matches the found security’s currency, if there are multiple securities with the same ISIN code in the system."},
{"pos": "846", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"9 tr.securityType No Security type Security type code of the transaction's security's type (as configured in the system). Used to determine features of a transaction."},
{"pos": "847", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"10 tr.account No Account Account number, if transaction is directed to an account. You can use the an account linked to the portfolio or shared to the portfolio. Define AUTO to record the transactions to the account with the same currency as the transaction, if such an account is found, or to the default account of the portfolio, if suitable currency account is not found. Define DEFAULT to always direct the transaction to the portfolio's default account. The system ignores white spaces in account numbers, and is thus able to recognize account numbers (such as IBAN numbers) defined with or without white spaces."},
{"pos": "848", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"11 tr.currency No Currency Transaction's currency (define with the currency code). If you don't define a currency for your transaction, the system will automatically determine it based on your transaction's data (available from FA 3.9 onward). Transaction's currency is either 1) Transaction's security's currency (if transaction is linked to a security) 2) Transaction's account's currency (for transactions not linked to a security but linked to account, i.e. CASH transactions) 3) Transaction's portfolio's currency (for transactions not linked to a security nor account, i.e. CASH transactions with \"No account\") After 3.9, best practice is to leave the currency empty, and the system will determine it for you. Before FA 3.9, transaction's currency was a mandatory field: define the currency with the currency security's code."},
{"pos": "849", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"12 tr.amount Yes Amount Number of units. Amount field only accepts the amount of decimals defined for the security type or as the block size of the security: if your file has more decimals in the amount, the amount is rounded to contain only accepted amount of decimals. If number of units is not available, you can leave it empty, when the system calculates the amount with \"unitPrice\" (#13) and \"tradeAmount\" (#14)."},
{"pos": "850", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"13 tr.unitPrice Yes Unit price Unit price is security currency (trade currency). Define AUTO to automatically use the transaction day's market data entry. For bonds, unit price can be set with % (e.g. 3.45%), when the system calculates the price according to YTM automatically. If unit price is not available or it is inaccurate, you can leave it empty, when the system calculates the unit price with \"amount\" (#12) and \"tradeAmount\" (#14)."},
{"pos": "851", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"14 tr.tradeAmount Yes Trade amount Value of the transaction in security currency (trade currency), i.e. money value of the transaction including costs, taxes, accrued interest etc. If trade amount is not available, you can leave it empty, when the system calculates the trade amount with \"amount\" (#12) and \"unitPrice\" (#13)."},
{"pos": "852", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"15 tr.fxRate No FX rate Exchange rate for the transaction. When importing an FX rate, the system automatically determines whether the exchange rate is account exchange rate (column #41) and\/or report exchange rate (column #42), and fills them in appropriately. Define AUTO to automatically use the transaction day's market data entry."},
{"pos": "853", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"16 tr.tax No Tax Tax in trade currency"},
{"pos": "854", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"17 tr.cost No Cost Fee in trade currency"},
{"pos": "855", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"18 tr.cost2 No Cost 2 Credit fee in trade currency"},
{"pos": "856", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"19 tr.origTransactionDate No Booked transaction date yyyy-MM-dd"},
{"pos": "857", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"20 tr.origUnitPrice No Booked unit price Booked unit price in trade currency"},
{"pos": "858", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"21 tr.origTradeAmount No Booked trade amount Booked trade amount. Define AUTO to automatically calculate the booked trade amount by multiplying the amount with transaction day's market data entry."},
{"pos": "859", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"22 tr.origFxRate No Booked FX rate Booked exchange rate between trade currency and portfolio's report currency. Define AUTO to automatically use the original transaction day's market data entry."},
{"pos": "860", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"23 tr.accruedInterest No Accrued interest Accrued interest in trade currency. For bonds, the accrued interest can be set with \"?\", when the system calculates the accrued interest automatically. Define AUTO to automatically calculate the accrued interest."},
{"pos": "861", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"24 tr.reference No Reference Reference of the transaction, usually transaction's reference number. Reference is used in combination with #1 Portfolio ID to update existing transactions if you haven't defined #2 External ID in your import file - if your reference can be found from an existing transaction, the existing transaction is updated."},
{"pos": "862", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"25 tr.counter No Counter Counter (use contact ID)"},
{"pos": "863", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"26 tr.counterPortfolio No Counter portfolio Counter portfolio (use portfolio code)"},
{"pos": "864", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"(27) (Ext info) Not used. Use tr.description in column #31 instead."},
{"pos": "865", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"28 tr.intInfo No Internal info Internal transaction description"},
{"pos": "866", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"29 tr.basis No Basis Not used."},
{"pos": "867", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"30 tr.priority No Priority Intraday priority of a transaction. -1,1,2,3... The transaction with the lowest priority has the highest number defined in the priority field (0 is lower than 1 and -1 is lower than 0). The default priority is 0."},
{"pos": "868", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"31 tr.description No Description Description\/comment on the transaction"},
{"pos": "869", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"32 tr.security2 No Security 2 Security code of the removed security (e.g. in the exchange, the one that is replaced)"},
{"pos": "870", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"33 tr.ratio No Ratio Define the ratio with syntax x:x (e.g. 1:2 or 2:3.25). Ratio is used for example for splits and exchanges. For splits, define the ratio between the number of securities before and after the split (with ratio 1:2, one security before the split would become two securities after the split). For exchanges, define the ratio as how many new securities are received with one removed security (with ratio 1:2, one removed security would become two new securities after the exchange)."},
{"pos": "871", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"34 tr.taxType No Tax type Tax type of the transaction defined with the tax type code"},
{"pos": "872", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"35 tr.marketPlace No Market place Use the exchange code \/ market place code."},
{"pos": "873", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"36 tr.tradeTime No Trade time hh:mm:ss You can also define the trade time with time zone information with the syntax of hh:mm:ssContinent\/City (e.g. 11:12:13Europe\/Helsinki, use valid java time zones) - when the transaction is imported, the trade time is converted into the server's time zone."},
{"pos": "874", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"37 tr.tax2 No Tax 2 Tax in trade currency"},
{"pos": "875", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"38 tr.taxType2 No Tax 2 type Tax type of the transaction defined with the tax type code"},
{"pos": "876", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"39 tr.tags No Tags Comma-separated list of tags. Tags import allows you to add new tags: Standalone tags are added with a <tag name>. For example: Fund,Urgent.Single-select group tags should be added as <group name>-<tag name>. For example: office-Helsinki. If a transaction already has a tag with the same group name, the tag is replaced.Multi-select group tags should be added as a comma-separated list of values <group name>:<tag name 1>,<group name>:<tag name 2>. For example: Campaign:EarlyBird,Campaign:Friends. If a transaction already has tags with the same group name, the new tag is added to the existing ones. You can use three minuses (---) syntax to remove a tag value: Standalone tags: ---<tag name>. For example: ---Fund,---Urgent.Single-select group tags: ---<group name>-<tag name>. For example: —office-Helsinki.Multi-select group tags: ---<group name>:<tag name 1>,<group name>:<tag name 2>. For example: ---Campaign:EarlyBird,---Campaign:Friends. For details, see Removing transaction and trade order values with three minuses (---)."},
{"pos": "877", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"40 tr.settlementPlace No Settlement place Use the settlement code."},
{"pos": "878", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"41 tr.accountFxRate No Account FX rate Exchange rate between trade currency and portfolio's account currency. Define AUTO to automatically use the transaction day's market data entry. If you are not sure whether you need account or report FX rate, use FX rate (column #15) instead, which automatically determines which one to use."},
{"pos": "879", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"42 tr.reportFxRate No Report FX rate Exchange rate between trade currency and portfolio's report currency. Define AUTO to automatically use the transaction day's market data entry. If you are not sure whether you need account or report FX rate, use FX rate (column #15) instead, which automatically determines which one to use."},
{"pos": "880", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"43 tr.coefficient No Coefficient Coefficient calculated from the linked security's price and index base value. Affects trade amount same as unit price. Define AUTO to automatically calculate coefficient on the transaction date from the linked security and index base value."},
{"pos": "881", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"44 tr.compCost1 No Break-down of cost 1 Define the break-down of costs as a list of transaction cost data with the syntax <type>=<value>. Types are from defined transaction cost type. E.g. BROK=15,ADV=22. If you also defined a Cost (column #17), your Break-down of cost 1 has to sum up to the total cost you defined! If you leave Cost empty, the system calculates it automatically as the sum of your break-down of costs."},
{"pos": "882", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"45 tr.compCost2 No Break-down of cost 2 Define the break-down of costs as a list of transaction cost data with the syntax <type>=<value>. Types are from defined transaction cost type. E.g. BROK=15,ADV=22. If you also defined a Cost 2 (column #18), your Break-down of cost 2 has to sum up to the total cost you defined! If you leave Cost empty, the system calculates it automatically as the sum of your break-down of costs."},
{"pos": "883", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"46 tr.costType1 No Transaction cost type 1 Type of selected transaction cost type. Value is from defined transaction cost type's type code."},
{"pos": "884", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"47 tr.costType2 No Transaction cost type 2 Type of selected transaction cost type. Value is from defined transaction cost type's type code."},
{"pos": "885", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"48 tr.hidden No Hidden Whether the transaction should be marked as hidden. Define as a number: 1 = Hidden 0 = Not hidden (default)"},
{"pos": "886", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"49 tr.paymentDate No Payment date yyyy-MM-dd"},
{"pos": "887", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"50 tr.accrual No Accrual Transaction's accrual, or the the paid\/received accrued income which is recorded as part of the price (unit price x amount). Accrual has no effect of the trade amount (Available from FA 3.7 onward)"},
{"pos": "888", "title":"FA Format for importing transactions", "document":["FA Back reference"], " ":[], "url":"fa-format-for-importing-transactions.html", "body":"(51) (Execution method) Not used for transactions, available only for trade orders. Value 0 is always used for transactions, since transactions don't have an execution method"},
{"pos": "889", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Convention Description"},
{"pos": "890", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Following Move to the next valid business day."},
{"pos": "891", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Modified following (without crossing mid-month or month end) Move to the next valid business day, unless that is after the 15th of the month OR in the next month in which case move to the previous valid business day."},
{"pos": "892", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Modified following (without crossing month end) Move to the next valid business day, unless that is in the next month in which case move to the previous valid business day."},
{"pos": "893", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Modified preceding (without crossing month start) Move to the previous valid business day, unless that is in the previous month in which case move to the next valid business day."},
{"pos": "894", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Nearest For Sunday and Monday, move to the next valid business day, for all other days, move to the previous valid business day."},
{"pos": "895", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"No adjustment Make no adjustment."},
{"pos": "896", "title":"NAV schedules tab", "document":["FA Fund management reference"], " ":[], "url":"fund-wizard.html#nav-schedules-tab", "body":"Preceeding Move to the previous valid business day."}]